[
    {
              "title": "I. PRELIMINARY",
              "text": "<small>Short title</small><br><br>&ensp;<b>1. </b>This Act may be cited as the <i>Constitution Act, 1867.</i> (2)<br>&ensp;<b>2. </b> Repealed. (3)",
              "notes": "<b><sup>(2)</sup> As amended by the Constitution Act, 1982, which came into force on April 17, 1982. The section originally read as follows:</b><br>&ensp; 1. This Act may be cited as <i>The British North America Act, 1867.</i><br><br><b><sup>(3)</sup> Section 2, repealed by the Statute Law Revision Act, 1893, 56-57 Vict., c. 14 (U.K.), read as follows:</b><br>&ensp; 2.The Provisions of this Act referring to Her Majesty the Queen extend also to the Heirs and Successors of Her Majesty, Kings and Queens of the United Kingdom of Great Britain and Ireland."
            },
            {
                "title": "II. UNION",
                "text" : "<small>Declaration of Union</small><br><br>&ensp;<b>3.</b> It shall be lawful for the Queen, by and with the Advice of Her Majesty’s Most Honourable Privy Council, to declare by Proclamation that, on and after a Day therein appointed, not being more than Six Months after the passing of this Act, the Provinces of Canada, Nova Scotia, and New Brunswick shall form and be One Dominion under the Name of Canada; and on and after that Day those Three Provinces shall form and be One Dominion under that Name accordingly. (4)<br><br><small>Construction of subsequent Provisions of Act</small><br><br>&ensp;<b>4.</b> Unless it is otherwise expressed or implied, the Name Canada shall be taken to mean Canada as constituted under this Act. (5)<br><br><small>Four Provinces</small><br><br>&ensp;<b>5.</b> Canada shall be divided into Four Provinces, named Ontario, Quebec, Nova Scotia, and New Brunswick. (6)<br><br><small>Provinces of Ontario and Quebec</small><br><br>&ensp;<b>6.</b> The Parts of the Province of Canada (as it exists at the passing of this Act) which formerly constituted respectively the Provinces of Upper Canada and Lower Canada shall be deemed to be severed, and shall form Two separate Provinces. The Part which formerly constituted the Province of Upper Canada shall constitute the Province of Ontario; and the Part which formerly constituted the Province of Lower Canada shall constitute the Province of Quebec.<br><br><small>Provinces of Nova Scotia and New Brunswick</small><br><br>&ensp;<b>7.</b> The Provinces of Nova Scotia and New Brunswick shall have the same Limits as at the passing of this Act.<br><br><small>Decennial Census</small><br><br>&ensp;<b>8.</b> In the general Census of the Population of Canada which is hereby required to be taken in the Year One thousand eight hundred and seventy-one, and in every Tenth Year thereafter, the respective Populations of the Four Provinces shall be distinguished.<br><br>",
                "notes": "<b><sup>(4)</sup>The first day of July, 1867, was fixed by proclamation dated May 22, 1867.</b><hr><b><sup>(5)</sup> Partially repealed by the <i>Statute Law Revision Act, 1893</i>, 56-57 Vict., c. 14 (U.K.). The section originally read as follows:</b><br>&ensp;<b>4.</b>  The subsequent Provisions of this Act shall, unless it is otherwise expressed or implied, commence and have effect on and after the Union, that is to say, on and after the Day appointed for the Union taking effect in the Queen’s Proclamation; and in the same Provisions, unless it is otherwise expressed or implied, the Name Canada shall be taken to mean Canada as constituted under this Act.<hr><b><sup>(6)</sup> Canada now consists of ten provinces (Ontario, Quebec, Nova Scotia, New Brunswick, Manitoba, British Columbia, Prince Edward Island, Alberta, Saskatchewan and Newfoundland and Labrador) and three territories (Yukon, the Northwest Territories and Nunavut).<br><br>The first territories added to the Union were Rupert’s Land and the North-Western Territory (subsequently designated the Northwest Territories), which were admitted pursuant to section 146 of the Constitution Act, 1867 and the Rupert’s Land Act, 1868, 31-32 Vict., c. 105 (U.K.), by the Rupert’s Land and North-Western Territory Order of June 23, 1870, effective July 15, 1870. Prior to the admission of those territories, the Parliament of Canada enacted An Act for the temporary Government of Rupert’s Land and the North-Western Territory when united with Canada (32-33 Vict., c. 3), and the Manitoba Act, 1870 (33 Vict., c. 3), which provided for the formation of the Province of Manitoba.<br><br>British Columbia was admitted into the Union pursuant to section 146 of the Constitution Act, 1867, by the British Columbia Terms of Union, being Order in Council of May 16, 1871, effective July 20, 1871.<br><br>Prince Edward Island was admitted pursuant to section 146 of the Constitution Act, 1867, by the Prince Edward Island Terms of Union, being Order in Council of June 26, 1873, effective July 1, 1873.<br><br>On June 29, 1871, the United Kingdom Parliament enacted the Constitution Act, 1871 (34-35 Vict., c. 28) authorizing the creation of additional provinces out of territories not included in any province. Pursuant to this statute, the Parliament of Canada enacted the Alberta Act (July 20, 1905, 4-5 Edw. VII, c. 3) and the Saskatchewan Act (July 20, 1905, 4-5 Edw. VII, c. 42), providing for the creation of the provinces of Alberta and Saskatchewan, respectively. Both of these Acts came into force on September 1, 1905.<br><br>Meanwhile, all remaining British possessions and territories in North America and the islands adjacent thereto, except the colony of Newfoundland and its dependencies, were admitted into the Canadian Confederation by the Adjacent Territories Order, dated July 31, 1880.<br><br>The Parliament of Canada added portions of the Northwest Territories to the adjoining provinces in 1912 by The Ontario Boundaries Extension Act, S.C. 1912, 2 Geo. V, c. 40, The Quebec Boundaries Extension Act, 1912, 2 Geo. V, c. 45 and The Manitoba Boundaries Extension Act, 1912, 2 Geo. V, c. 32, and further additions were made to Manitoba by The Manitoba Boundaries Extension Act, 1930, 20-21 Geo. V, c. 28.<br><br>The Yukon Territory was created out of the Northwest Territories in 1898 by The Yukon Territory Act, 61 Vict., c. 6.<br><br>Newfoundland was added on March 31, 1949, by the Newfoundland Act, 12-13 Geo. VI, c. 22 (U.K.), which ratified the Terms of Union of Newfoundland with Canada.<br>Nunavut was created out of the Northwest Territories in 1999 by the Nunavut Act, S.C. 1993, c. 28.</b><br><br>"
            },
            {
                "title": "III. EXECUTIVE POWER",
                "text": "<small>Declaration of Executive Power in the Queen</small><br><br>&ensp;<b>9.</b> The Executive Government and Authority of and over Canada is hereby declared to continue and be vested in the Queen.<br><br><small>Application of Provisions referring to Governor General</small><br><br>&ensp;<b>10.</b> The Provisions of this Act referring to the Governor General extend and apply to the Governor General for the Time being of Canada, or other the Chief Executive Officer or Administrator for the Time being carrying on the Government of Canada on behalf and in the Name of the Queen, by whatever Title he is designated.<br><br><small>Constitution of Privy Council for Canada</small><br><br>&ensp;<b>11.</b> There shall be a Council to aid and advise in the Government of Canada, to be styled the Queen’s Privy Council for Canada; and the Persons who are to be Members of that Council shall be from Time to Time chosen and summoned by the Governor General and sworn in as Privy Councillors, and Members thereof may be from Time to Time removed by the Governor General.<br><br><small>All Powers under Acts to be exercised by Governor General with Advice of Privy Council, or alone</small><br><br>&ensp;<b>12.</b> All Powers, Authorities, and Functions which under any Act of the Parliament of Great Britain, or of the Parliament of the United Kingdom of Great Britain and Ireland, or of the Legislature of Upper Canada, Lower Canada, Canada, Nova Scotia, or New Brunswick, are at the Union vested in or exerciseable by the respective Governors or Lieutenant Governors of those Provinces, with the Advice, or with the Advice and Consent, of the respective Executive Councils thereof, or in conjunction with those Councils, or with any Number of Members thereof, or by those Governors or Lieutenant Governors individually, shall, as far as the same continue in existence and capable of being exercised after the Union in relation to the Government of Canada, be vested in and exerciseable by the Governor General, with the Advice or with the Advice and Consent of or in conjunction with the Queen’s Privy Council for Canada, or any Members thereof, or by the Governor General individually, as the Case requires, subject nevertheless (except with respect to such as exist under Acts of the Parliament of Great Britain or of the Parliament of the United Kingdom of Great Britain and Ireland) to be abolished or altered by the Parliament of Canada. (7)<br><br><small>Application of Provisions referring to Governor General in Council</small><br><br>&ensp;<b>13.</b> The Provisions of this Act referring to the Governor General in Council shall be construed as referring to the Governor General acting by and with the Advice of the Queen’s Privy Council for Canada.<br><br><small>Power to Her Majesty to authorize Governor General to appoint Deputies</small><br><br>&ensp;<b>14.</b> It shall be lawful for the Queen, if Her Majesty thinks fit, to authorize the Governor General from Time to Time to appoint any Person or any Persons jointly or severally to be his Deputy or Deputies within any Part or Parts of Canada, and in that Capacity to exercise during the Pleasure of the Governor General such of the Powers, Authorities, and Functions of the Governor General as the Governor General deems it necessary or expedient to assign to him or them, subject to any Limitations or Directions expressed or given by the Queen; but the Appointment of such a Deputy or Deputies shall not affect the Exercise by the Governor General himself of any Power, Authority, or Function.<br><br><small>Command of Armed Forces to continue to be vested in the Queen</small><br><br>&ensp;<b>15.</b> The Command-in-Chief of the Land and Naval Militia, and of all Naval and Military Forces, of and in Canada, is hereby declared to continue and be vested in the Queen.<br><br><small>Seat of Government of Canada</small><br><br>&ensp;<b>16.</b> Until the Queen otherwise directs, the Seat of Government of Canada shall be Ottawa.<br><br>",
                "notes":"<b><sup>(7)</sup> See footnote (65) to section 129.</b>"
            },
            {
                "title":"IV. LEGISLATIVE POWER",
                "text": "<small>Constitution of Parliament of Canada</small><br><br>&ensp;<b>17.</b> There shall be One Parliament for Canada, consisting of the Queen, an Upper House styled the Senate, and the House of Commons.<hr><small>Privileges, etc., of Houses</small><br><br>&ensp;<b>18. </b>The privileges, immunities, and powers to be held, enjoyed, and exercised by the Senate and by the House of Commons, and by the members thereof respectively, shall be such as are from time to time defined by Act of the Parliament of Canada, but so that any Act of the Parliament of Canada defining such privileges, immunities, and powers shall not confer any privileges, immunities, or powers exceeding those at the passing of such Act held, enjoyed, and exercised by the Commons House of Parliament of the United Kingdom of Great Britain and Ireland, and by the members thereof. (8)<hr><small>First Session of the Parliament of Canada</small><br><br>&ensp;<b>19. </b>The Parliament of Canada shall be called together not later than Six Months after the Union. (9)<br>&ensp;<b>20. </b>Repealed. (10)<hr><p style=\"text-align:center\">The Senate</p><small>Number of Senators</small><br><br>&ensp;<b>21. </b>The Senate shall, subject to the Provisions of this Act, consist of One Hundred and five Members, who shall be styled Senators. (11)<hr><small>Representation of Provinces in Senate</small><br><br>&ensp;<b>22. </b>In relation to the Constitution of the Senate Canada shall be deemed to consist of Four Divisions:<ol><li>Ontario;</li><li>Quebec;</li><li>The Maritime Provinces, Nova Scotia and New Brunswick, and Prince Edward Island;</li><li>The Western Provinces of Manitoba, British Columbia, Saskatchewan, and Alberta;<br>which Four Divisions shall (subject to the Provisions of this Act) be equally represented in the Senate as follows: Ontario by twenty-four senators; Quebec by twenty-four senators; the Maritime Provinces and Prince Edward Island by twenty-four senators, ten thereof representing Nova Scotia, ten thereof representing New Brunswick, and four thereof representing Prince Edward Island; the Western Provinces by twenty-four senators, six thereof representing Manitoba, six thereof representing British Columbia, six thereof representing Saskatchewan, and six thereof representing Alberta; Newfoundland shall be entitled to be represented in the Senate by six members; the Yukon Territory, the Northwest Territories and Nunavut shall be entitled to be represented in the Senate by one member each.</li></ol><br>In the Case of Quebec each of the Twenty-four Senators representing that Province shall be appointed for One of the Twenty-four Electoral Divisions of Lower Canada specified in Schedule A. to Chapter One of the Consolidated Statutes of Canada. (12)<hr><small>Qualifications of Senator</small><br><br>&ensp;<b>23. </b>The Qualifications of a Senator shall be as follows:<br><br><ol><li>He shall be of the full age of Thirty Years;</li><li>He shall be either a natural-born Subject of the Queen, or a Subject of the Queen naturalized by an Act of the Parliament of Great Britain, or of the Parliament of the United Kingdom of Great Britain and Ireland, or of the Legislature of One of the Provinces of Upper Canada, Lower Canada, Canada, Nova Scotia, or New Brunswick, before the Union, or of the Parliament of Canada after the Union;</li><li>He shall be legally or equitably seised as of Freehold for his own Use and Benefit of Lands or Tenements held in Free and Common Socage, or seised or possessed for his own Use and Benefit of Lands or Tenements held in Franc-alleu or in Roture, within the Province for which he is appointed, of the Value of Four thousand Dollars, over and above all Rents, Dues, Debts, Charges, Mortgages, and Incumbrances due or payable out of or charged on or affecting the same;</li><li>His Real and Personal Property shall be together worth Four thousand Dollars over and above his Debts and Liabilities;</li><li>He shall be resident in the Province for which he is appointed;</li><li>In the Case of Quebec he shall have his Real Property Qualification in the Electoral Division for which he is appointed, or shall be resident in that Division. (13)</li></ol><hr><small>Summons of Senator</small><br><br>&ensp;<b>24. </b>The Governor General shall from Time to Time, in the Queen’s Name, by Instrument under the Great Seal of Canada, summon qualified Persons to the Senate; and, subject to the Provisions of this Act, every Person so summoned shall become and be a Member of the Senate and a Senator.<hr>&ensp;<b>25. </b>Repealed. (14)<hr><small>Addition of Senators in certain cases</small><br><br>&ensp;<b>26. </b>If at any Time on the Recommendation of the Governor General the Queen thinks fit to direct that Four or Eight Members be added to the Senate, the Governor General may by Summons to Four or Eight qualified Persons (as the Case may be), representing equally the Four Divisions of Canada, add to the Senate accordingly. (15)<hr><small>Reduction of Senate to normal Number</small><br><br>&ensp;<b>27. </b>In case of such Addition being at any Time made, the Governor General shall not summon any Person to the Senate, except on a further like Direction by the Queen on the like Recommendation, to represent one of the Four Divisions until such Division is represented by Twenty-four Senators and no more. (16)<hr><small>Maximum Number of Senators</small><br><br>&ensp;<b>28. </b>The Number of Senators shall not at any Time exceed One Hundred and thirteen. (17)<hr><small>Tenure of Place in Senate</small><br><br>&ensp;<b>29. </b>(1) Subject to subsection (2), a Senator shall, subject to the provisions of this Act, hold his place in the Senate for life.<hr><small>Retirement upon attaining age of seventy-five years</small><br><br>(2) A Senator who is summoned to the Senate after the coming into force of this subsection shall, subject to this Act, hold his place in the Senate until he attains the age of seventy-five years. (18)<hr><small>Resignation of Place in Senate</small><br><br>&ensp;<b>30. </b>A Senator may by Writing under his Hand addressed to the Governor General resign his Place in the Senate, and thereupon the same shall be vacant.<hr><small>Disqualification of Senators</small><br><br>&ensp;<b>31. </b>The Place of a Senator shall become vacant in any of the following Cases:<ol><li>If for Two consecutive Sessions of the Parliament he fails to give his Attendance in the Senate;</li><li>If he takes an Oath or makes a Declaration or Acknowledgment of Allegiance, Obedience, or Adherence to a Foreign Power, or does an Act whereby he becomes a Subject or Citizen, or entitled to the Rights or Privileges of a Subject or Citizen, of a Foreign Power;</li><li>If he is adjudged Bankrupt or Insolvent, or applies for the Benefit of any Law relating to Insolvent Debtors, or becomes a public Defaulter;</li><li>If he is attainted of Treason or convicted of Felony or of any infamous Crime;</li><li>If he ceases to be qualified in respect of Property or of Residence; provided, that a Senator shall not be deemed to have ceased to be qualified in respect of Residence by reason only of his residing at the Seat of the Government of Canada while holding an Office under that Government requiring his Presence there.</li></ol><hr><small>Summons on Vacancy in Senate</small><br><br>&ensp;<b>32. </b>When a Vacancy happens in the Senate by Resignation, Death, or otherwise, the Governor General shall by Summons to a fit and qualified Person fill the Vacancy.<hr><small>Questions as to Qualifications and Vacancies in Senate</small><br><br>&ensp;<b>33. </b>If any Question arises respecting the Qualification of a Senator or a Vacancy in the Senate the same shall be heard and determined by the Senate.<hr><small>Appointment of Speaker of Senate</small><br><br>&ensp;<b>34. </b>The Governor General may from Time to Time, by Instrument under the Great Seal of Canada, appoint a Senator to be Speaker of the Senate, and may remove him and appoint another in his Stead. (19)<hr><small>Quorum of Senate</small><br><br>&ensp;<b>35. </b>Until the Parliament of Canada otherwise provides, the Presence of at least Fifteen Senators, including the Speaker, shall be necessary to constitute a Meeting of the Senate for the Exercise of its Powers.<hr>                <small>Voting in Senate</small><br><br>&ensp;<b>36. </b>Questions arising in the Senate shall be decided by a Majority of Voices, and the Speaker shall in all Cases have a Vote, and when the Voices are equal the Decision shall be deemed to be in the Negative.<br><br><p style=\"text-align: center\">The House of Commons</p><hr><small>Constitution of House of Commons in Canada</small><hr> <b>37. </b>The House of Commons shall, subject to the Provisions of this Act, consist of three hundred and eight members of whom one hundred and six shall be elected for Ontario, seventy-five for Quebec, eleven for Nova Scotia, ten for New Brunswick, fourteen for Manitoba, thirty-six for British Columbia, four for Prince Edward Island, twenty-eight for Alberta, fourteen for Saskatchewan, seven for Newfoundland, one for the Yukon Territory, one for the Northwest Territories and one for Nunavut. (20)<hr><small>Summoning of House of Commons</small><br><br>&ensp;<b>38. </b>The Governor General shall from Time to Time, in the Queen’s Name, by Instrument under the Great Seal of Canada, summon and call together the House of Commons.<hr><small>Senators not to sit in House of Commons</small><br><br>&ensp;<b>39. </b>A Senator shall not be capable of being elected or of sitting or voting as a Member of the House of Commons.<hr><small>Electoral districts of the four Provinces</small><br><br>&ensp;<b>40. </b>Until the Parliament of Canada otherwise provides, Ontario, Quebec, Nova Scotia, and New Brunswick shall, for the Purposes of the Election of Members to serve in the House of Commons, be divided into Electoral Districts as follows:<br><br><p style=\"text-align:center\">1. Ontario</p><br><br>Ontario shall be divided into the Counties, Ridings of Counties, Cities, Parts of Cities, and Towns enumerated in the First Schedule to this Act, each whereof shall be an Electoral District, each such District as numbered in that Schedule being entitled to return One Member.<br><br><p style=\"text-align:center\">2. Quebec</p><br><br>Quebec shall be divided into Sixty-five Electoral Districts, composed of the Sixty-five Electoral Divisions into which Lower Canada is at the passing of this Act divided under Chapter Two of the Consolidated Statutes of Canada, Chapter Seventy-five of the Consolidated Statutes for Lower Canada, and the Act of the Province of Canada of the Twenty-third Year of the Queen, Chapter One, or any other Act amending the same in force at the Union, so that each such Electoral Division shall be for the Purposes of this Act an Electoral District entitled to return One Member.<br><br><p style=\"text-align:center\">3. Nova Scotia</p><br><br>Each of the Eighteen Counties of Nova Scotia shall be an Electoral District. The County of Halifax shall be entitled to return Two Members, and each of the other Counties One Member.<br><br><p style=\"text-align:center\">4. New Brunswick</p><br><br>Each of the Fourteen Counties into which New Brunswick is divided, including the City and County of St. John, shall be an Electoral District. The City of St. John shall also be a separate Electoral District. Each of those Fifteen Electoral Districts shall be entitled to return One Member. (21)<br><br><small>Continuance of existing Election Laws until Parliament of Canada otherwise provides</small><br><br>&ensp;<b>41. </b>Until the Parliament of Canada otherwise provides, all Laws in force in the several Provinces at the Union relative to the following Matters or any of them, namely, — the Qualifications and Disqualifications of Persons to be elected or to sit or vote as Members of the House of Assembly or Legislative Assembly in the several Provinces, the Voters at Elections of such Members, the Oaths to be taken by Voters, the Returning Officers, their Powers and Duties, the Proceedings at Elections, the Periods during which Elections may be continued, the Trial of controverted Elections, and Proceedings incident thereto, the vacating of Seats of Members, and the Execution of new Writs in case of Seats vacated otherwise than by Dissolution, — shall respectively apply to Elections of Members to serve in the House of Commons for the same several Provinces.<br><br>Provided that, until the Parliament of Canada otherwise provides, at any Election for a Member of the House of Commons for the District of Algoma, in addition to Persons qualified by the Law of the Province of Canada to vote, every Male British Subject, aged Twenty-one Years or upwards, being a Householder, shall have a Vote. (22)<hr>&ensp;<b>42. </b>Repealed. (23)<hr>&ensp;<b>43. </b>Repealed. (24)<hr><small>As to Election of Speaker of House of Commons</small><br><br>&ensp;<b>44. </b>The House of Commons on its first assembling after a General Election shall proceed with all practicable Speed to elect One of its Members to be Speaker.<hr><small>As to filling up Vacancy in Office of Speaker</small><br><br>&ensp;<b>45. </b>In case of a Vacancy happening in the Office of Speaker by Death, Resignation, or otherwise, the House of Commons shall with all practicable Speed proceed to elect another of its Members to be Speaker.<hr><small>Speaker to preside</small><br><br>&ensp;<b>46. </b>The Speaker shall preside at all Meetings of the House of Commons.<hr><small>Provision in case of Absence of Speaker</small><br><br>&ensp;<b>47. </b>Until the Parliament of Canada otherwise provides, in case of the Absence for any Reason of the Speaker from the Chair of the House of Commons for a Period of Forty-eight consecutive Hours, the House may elect another of its Members to act as Speaker, and the Member so elected shall during the Continuance of such Absence of the Speaker have and execute all the Powers, Privileges, and Duties of Speaker. (25)<hr><small>Quorum of House of Commons</small><br><br>&ensp;<b>48. </b>The Presence of at least Twenty Members of the House of Commons shall be necessary to constitute a Meeting of the House for the Exercise of its Powers, and for that Purpose the Speaker shall be reckoned as a Member.<hr><small>Voting in House of Commons</small><br><br>&ensp;<b>49. </b>Questions arising in the House of Commons shall be decided by a Majority of Voices other than that of the Speaker, and when the Voices are equal, but not otherwise, the Speaker shall have a Vote.<hr><small>Duration of House of Commons</small><br><br>&ensp;<b>50. </b>Every House of Commons shall continue for Five Years from the Day of the Return of the Writs for choosing the House (subject to be sooner dissolved by the Governor General), and no longer. (26)<hr><small>Readjustment of representation in Commons</small><br><br>&ensp;<b>51. </b>(1) The number of members of the House of Commons and the representation of the provinces therein shall, on the completion of each decennial census, be readjusted by such authority, in such manner, and from such time as the Parliament of Canada provides from time to time, subject and according to the following rules:<br>Rules<br><ol><li>There shall be assigned to each of the provinces a number of members equal to the number obtained by dividing the population of the province by the electoral quotient and rounding up any fractional remainder to one.</li><li>If the number of members assigned to a province by the application of rule 1 and section 51A is less than the total number assigned to that province on the date of the coming into force of the Constitution Act, 1985 (Representation), there shall be added to the number of members so assigned such number of members as will result in the province having the same number of members as were assigned on that date.</li><li>After the application of rules 1 and 2 and section 51A, there shall, in respect of each province that meets the condition set out in rule 4, be added, if necessary, a number of members such that, on the completion of the readjustment, the number obtained by dividing the number of members assigned to that province by the total number of members assigned to all the provinces is as close as possible to, without being below, the number obtained by dividing the population of that province by the total population of all the provinces.</li><li>Rule 3 applies to a province if, on the completion of the preceding readjustment, the number obtained by dividing the number of members assigned to that province by the total number of members assigned to all the provinces was equal to or greater than the number obtained by dividing the population of that province by the total population of all the provinces, the population of each province being its population as at July 1 of the year of the decennial census that preceded that readjustment according to the estimates prepared for the purpose of that readjustment.</li><li>Unless the context indicates otherwise, in these rules, the population of a province is the estimate of its population as at July 1 of the year of the most recent decennial census.</li><li>In these rules, “electoral quotient” means<br>(a)<br>111,166, in relation to the readjustment following the completion of the 2011 decennial census, and<br>(b)<br>in relation to the readjustment following the completion of any subsequent decennial census, the number obtained by multiplying the electoral quotient that was applied in the preceding readjustment by the number that is the average of the numbers obtained by dividing the population of each province by the population of the province as at July 1 of the year of the preceding decennial census according to the estimates prepared for the purpose of the preceding readjustment, and rounding up any fractional remainder of that multiplication to one.</li></ol><hr><small>Population estimates</small><br><br>&ensp;(1.1) For the purpose of the rules in subsection (1), there is required to be prepared an estimate of the population of Canada and of each province as at July 1, 2001 and July 1, 2011 — and, in each year following the 2011 decennial census in which a decennial census is taken, as at July 1 of that year — by such authority, in such manner, and from such time as the Parliament of Canada provides from time to time. (27)<hr><small>Yukon Territory, Northwest Territories and Nunavut</small><br><br>&ensp;(2) The Yukon Territory as bounded and described in the schedule to chapter Y-2 of the Revised Statutes of Canada, 1985, shall be entitled to one member, the Northwest Territories as bounded and described in section 2 of chapter N-27 of the Revised Statutes of Canada, 1985, as amended by section 77 of chapter 28 of the Statutes of Canada, 1993, shall be entitled to one member, and Nunavut as bounded and described in section 3 of chapter 28 of the Statutes of Canada, 1993, shall be entitled to one member. (28)<hr><small>Constitution of House of Commons</small><br><br>&ensp;<b>51A. </b>Notwithstanding anything in this Act a province shall always be entitled to a number of members in the House of Commons not less than the number of senators representing such province. (29)<hr><small>Increase of Number of House of Commons</small><br><br>&ensp;<b>51. </b>The Number of Members of the House of Commons may be from Time to Time increased by the Parliament of Canada, provided the proportionate Representation of the Provinces prescribed by this Act is not thereby disturbed.<hr><p style=\"text-align:center\">Money Votes; Royal Assent</p><small>Appropriation and Tax Bills</small><br><br>&ensp;<b>53. </b>Bills for appropriating any Part of the Public Revenue, or for imposing any Tax or Impost, shall originate in the House of Commons.<hr><small>Recommendation of Money Votes</small><br><br>&ensp;<b>54. </b>It shall not be lawful for the House of Commons to adopt or pass any Vote, Resolution, Address, or Bill for the Appropriation of any Part of the Public Revenue, or of any Tax or Impost, to any Purpose that has not been first recommended to that House by Message of the Governor General in the Session in which such Vote, Resolution, Address, or Bill is proposed.<hr><small>Royal Assent to Bills, etc.</small><br><br>&ensp;<b>55. </b>Where a Bill passed by the Houses of the Parliament is presented to the Governor General for the Queen’s Assent, he shall declare, according to his Discretion, but subject to the Provisions of this Act and to Her Majesty’s Instructions, either that he assents thereto in the Queen’s Name, or that he withholds the Queen’s Assent, or that he reserves the Bill for the Signification of the Queen’s Pleasure.<hr><small>Disallowance by Order in Council of Act assented to by Governor General</small><br><br>&ensp;<b>56. </b>Where the Governor General assents to a Bill in the Queen’s Name, he shall by the first convenient Opportunity send an authentic Copy of the Act to One of Her Majesty’s Principal Secretaries of State, and if the Queen in Council within Two Years after Receipt thereof by the Secretary of State thinks fit to disallow the Act, such Disallowance (with a Certificate of the Secretary of State of the Day on which the Act was received by him) being signified by the Governor General, by Speech or Message to each of the Houses of the Parliament or by Proclamation, shall annul the Act from and after the Day of such Signification.<hr><small>Signification of Queen’s Pleasure on Bill reserved</small><br><br>&ensp;<b>57. </b>A Bill reserved for the Signification of the Queen’s Pleasure shall not have any Force unless and until, within Two Years from the Day on which it was presented to the Governor General for the Queen’s Assent, the Governor General signifies, by Speech or Message to each of the Houses of the Parliament or by Proclamation, that it has received the Assent of the Queen in Council.<br><br>An Entry of every such Speech, Message, or Proclamation shall be made in the Journal of each House, and a Duplicate thereof duly attested shall be delivered to the proper Officer to be kept among the Records of Canada.<hr>",
                "notes" : "<b><sup>(8)</sup> Repealed and re-enacted by the Parliament of Canada Act, 1875, 38-39 Vict., c. 38 (U.K.). The original section read as follows:</b><br><br>&ensp;<b>18 </b>The Privileges, Immunities, and Powers to be held, enjoyed, and exercised by the Senate and by the House of Commons and by the Members thereof respectively shall be such as are from Time to Time defined by Act of the Parliament of Canada, but so that the same shall never exceed those at the passing of this Act held, enjoyed, and exercised by the Commons House of Parliament of the United Kingdom of Great Britain and Ireland and by the Members thereof.<hr><b><sup>(9)</sup> Spent. The first session of the first Parliament began on November 6, 1867.</b><b><sup>(10)</sup> Section 20, repealed by the Constitution Act, 1982, read as follows:</b><br><br>&ensp;<b>20. </b>There shall be a Session of the Parliament of Canada once at least in every Year, so that Twelve Months shall not intervene between the last Sitting of the Parliament in one Session and its first sitting in the next Session.<br><br><b>Section 20 has been replaced by section 5 of the Constitution Act, 1982, which provides that there shall be a sitting of Parliament at least once every twelve months.</b><hr><b><sup>(11)</sup> As amended by the Constitution Act, 1915, 5-6 Geo. V, c. 45 (U.K.) and modified by the Newfoundland Act, 12-13 Geo. VI, c. 22 (U.K.), the Constitution Act (No. 2), 1975, S.C. 1974-75-76, c. 53, and the Constitution Act, 1999 (Nunavut), S.C. 1998, c. 15, Part 2. The original section read as follows:</b><br><br>&ensp;<b>21. </b>The Senate shall, subject to the Provisions of this Act, consist of Seventy-two Members, who shall be styled Senators.<br><br><b>The Manitoba Act, 1870, added two senators for Manitoba; the British Columbia Terms of Union added three; upon admission of Prince Edward Island four more were provided by section 147 of the Constitution Act, 1867; the Alberta Act and the Saskatchewan Act each added four. The Senate was reconstituted at 96 by the Constitution Act, 1915. Six more senators were added upon union with Newfoundland, and one senator each was added for Yukon and the Northwest Territories by the Constitution Act (No. 2), 1975. One senator was added for Nunavut by the Constitution Act, 1999 (Nunavut).</b><hr><b><sup>(12)</sup> As amended by the Constitution Act, 1915, 5-6 Geo. V, c. 45 (U.K.), the Newfoundland Act, 12-13 Geo. VI, c. 22 (U.K.), the Constitution Act (No. 2), 1975, S.C. 1974-75-76, c. 53 and the Constitution Act, 1999 (Nunavut), S.C. 1998, c. 15, Part 2. The original section read as follows:</b><br><br>&ensp;<b>22. </b>In relation to the Constitution of the Senate, Canada shall be deemed to consist of Three Divisions:<br><ol><li>Ontario;</li><li>Quebec;</li><li>The Maritime Provinces, Nova Scotia and New Brunswick;</li></ol><br>which Three Divisions shall (subject to the Provisions of this Act) be equally represented in the Senate as follows: Ontario by Twenty-four Senators; Quebec by Twenty-four Senators; and the Maritime Provinces by Twenty-four Senators, Twelve thereof representing Nova Scotia, and Twelve thereof representing New Brunswick.<br><br>In the case of Quebec each of the Twenty-four Senators representing that Province shall be appointed for One of the Twenty-four Electoral Divisions of Lower Canada specified in Schedule A. to Chapter One of the Consolidated Statutes of Canada.<br><br><b>The reference in section 22 to the Consolidated Statutes of Canada is a reference to the Consolidated Statutes of 1859.</b><hr><b><sup>(13)</sup> Section 44 of the Constitution Act, 1999 (Nunavut), S.C. 1998, c. 15, Part 2, provided that, for the purposes of that Part (which added one senator for Nunavut), the word “Province” in section 23 of the Constitution Act, 1867 has the same meaning as is assigned to the word “province” by section 35 of the Interpretation Act, R.S.C. 1985, c. I-21, as amended, which provides that the term “province” means “a province of Canada, and includes Yukon, the Northwest Territories and Nunavut”.<br><br>Section 2 of the Constitution Act (No. 2), 1975, S.C. 1974-75-76, c. 53, provided that for the purposes of that Act (which added one senator each for the Yukon Territory and the Northwest Territories) the term “Province” in section 23 of the Constitution Act, 1867 has the same meaning as is assigned to the term “province” by section 28 of the Interpretation Act, R.S.C. 1970, c. I-23, which provides that the term “province” means “a province of Canada, and includes the Yukon Territory and the Northwest Territories”.</b><b><sup>(14)</sup> Repealed by the Statute Law Revision Act, 1893, 56-57 Vict., c. 14 (U.K.). The section read as follows:</b><br><br>&ensp;<b>25. </b>Such Persons shall be first summoned to the Senate as the Queen by Warrant under Her Majesty’s Royal Sign Manual thinks fit to approve, and their Names shall be inserted in the Queen’s Proclamation of Union.<hr><b><sup>(15)</sup> As amended by the Constitution Act, 1915, 5-6 Geo. V, c. 45 (U.K.). The original section read as follows:</b><br><br>&ensp;<b>26. </b>If at any Time on the Recommendation of the Governor General the Queen thinks fit to direct that Three or Six Members be added to the Senate, the Governor General may by Summons to Three or Six qualified Persons (as the Case may be), representing equally the Three Divisions of Canada, add to the Senate accordingly.<hr><b><sup>(16)</sup> As amended by the Constitution Act, 1915, 5-6 Geo. V, c. 45 (U.K.). The original section read as follows:</b><br><br>&ensp;<b>27. </b>In case of such Addition being at any Time made the Governor General shall not summon any Person to the Senate except on a further like Direction by the Queen on the like Recommendation, until each of the Three Divisions of Canada is represented by Twenty-four Senators and no more.<hr><b><sup>(17)</sup> As amended by the Constitution Act, 1915, 5-6 Geo. V, c. 45 (U.K.), the Constitution Act (No. 2), 1975, S.C. 1974-75-76, c. 53, and the Constitution Act, 1999 (Nunavut), S.C. 1998, c. 15, Part 2. The original section read as follows:</b><br><br>&ensp;<b>28. </b>The Number of Senators shall not at any Time exceed Seventy-eight.<hr><b><sup>(18)</sup> As enacted by the Constitution Act, 1965, S.C. 1965, c. 4, which came into force on June 2, 1965. The original section read as follows:</b><br><br>&ensp;<b>29. </b>A Senator shall, subject to the Provisions of this Act, hold his Place in the Senate for Life.<hr><b><sup>(19)</sup> Provision for exercising the functions of Speaker during his or her absence is made by Part II of the Parliament of Canada Act, R.S.C. 1985, c. P-1 (formerly the Speaker of the Senate Act, R.S.C. 1970, c. S-14). Doubts as to the power of Parliament to enact the Speaker of the Senate Act were removed by the Canadian Speaker (Appointment of Deputy) Act, 1895, 2nd Sess., 59 Vict., c. 3 (U.K.), which was repealed by the Constitution Act, 1982.</b><hr><b><sup>(20)</sup> The figures given here result from the application of section 51, as enacted by the Constitution Act, 1985 (Representation), S.C. 1986, c. 8, Part I, and amended by the Constitution Act, 1999 (Nunavut), S.C. 1998, c. 15, Part 2, and readjustments made pursuant to the Electoral Boundaries Readjustment Act, R.S.C. 1985, c. E-3. The original section (which was altered from time to time as the result of the addition of new provinces and changes in population) read as follows:</b><br><br>&ensp;<b>37. </b>The House of Commons shall, subject to the Provisions of this Act, consist of one hundred and eighty-one members, of whom Eighty-two shall be elected for Ontario, Sixty-five for Quebec, Nineteen for Nova Scotia, and Fifteen for New Brunswick.<hr><b><sup>(21)</sup> Spent. The electoral districts are now established by proclamations issued from time to time under the Electoral Boundaries Readjustment Act, R.S.C. 1985, c. E-3, as amended for particular districts by Acts of Parliament (see the most recent Table of Public Statutes and Responsible Ministers).</b><hr><b><sup>(22)</sup> Spent. Elections are now provided for by the Canada Elections Act, S.C. 2000, c. 9; qualifications and disqualifications of members by the Parliament of Canada Act, R.S.C. 1985, c. P-1. The right of citizens to vote and hold office is provided for in section 3 of the Constitution Act, 1982.</b><hr><b><sup>(23)</sup> Repealed by the Statute Law Revision Act, 1893, 56-57 Vict., c. 14 (U.K.). The section read as follows:</b><br><br>&ensp;<b>42. </b>For the First Election of Members to serve in the House of Commons the Governor General shall cause Writs to be issued by such Person, in such Form, and addressed to such Returning Officers as he thinks fit.<br><br> <p>The Person issuing Writs under this Section shall have the like Powers as are possessed at the Union by the Officers charged with the issuing of Writs for the Election of Members to serve in the respective House of Assembly or Legislative Assembly of the Province of Canada, Nova Scotia, or New Brunswick; and the Returning Officers to whom Writs are directed under this Section shall have the like Powers as are possessed at the Union by the Officers charged with the returning of Writs for the Election of Members to serve in the same respective House of Assembly or Legislative Assembly.</p><hr><b><sup>(24)</sup> Repealed by the Statute Law Revision Act, 1893, 56-57 Vict., c. 14 (U.K.). The section read as follows:</b><br><br>&ensp;<b>43. </b>  In case a Vacancy in the Representation in the House of Commons of any Electoral District happens before the Meeting of the Parliament, or after the Meeting of the Parliament before Provision is made by the Parliament in this Behalf, the Provisions of the last foregoing Section of this Act shall extend and apply to the issuing and returning of a Writ in respect of such Vacant District.<hr><b><sup>(25)</sup> Provision for exercising the functions of Speaker during his or her absence is now made by Part III of the Parliament of Canada Act, R.S.C. 1985, c. P-1.</b><hr><b><sup>(26)</sup> The term of the 12th Parliament was extended by the British North America Act, 1916, 6-7 Geo. V., c. 19 (U.K.), which Act was repealed by the Statute Law Revision Act, 1927, 17-18 Geo. V, c. 42 (U.K.). See also the Constitution Act, 1982, subsection 4(1), which provides that no House of Commons shall continue for longer than five years from the date fixed for the return of the writs at a general election of its members, and subsection 4(2), which provides for continuation of the House of Commons in special circumstances.</b><hr><b><sup>(27)</sup> As enacted by the Fair Representation Act, S.C. 2011, c. 26, s. 2, which came into force on royal assent on December 16, 2011.<br><br>The section, as originally enacted, read as follows:</b><br><br>&ensp;<b>51. </b>On the Completion of the Census in the Year One Thousand eight hundred and seventy-one, and of each subsequent decennial Census, the Representation of the Four Provinces shall be readjusted by such Authority, in such Manner, and from such Time, as the Parliament of Canada from Time to Time provides, subject and according to the following Rules:<br><br><ol><li>Quebec shall have the fixed Number of Sixty-five Members:</li><li>There shall be assigned to each of the other Provinces such a Number of Members as will bear the same Proportion to the Number of its Population (ascertained at such Census) as the Number Sixty-five bears to the Number of the Population of Quebec (so ascertained):</li><li>In the Computation of the Number of Members for a Province a fractional Part not exceeding One Half of the whole Number requisite for entitling the Province to a Member shall be disregarded; but a fractional Part exceeding One Half of that Number shall be equivalent to the whole Number:</li><li>On any such Re-adjustment the Number of Members for a Province shall not be reduced unless the Proportion which the Number of the Population of the Province bore to the Number of the aggregate Population of Canada at the then last preceding Re-adjustment of the Number of Members for the Province is ascertained at the then latest Census to be diminished by One Twentieth Part or upwards:</li><li>Such Re-adjustment shall not take effect until the Termination of the then existing Parliament.</li></ol><br><br><b>The section was amended by the Statute Law Revision Act, 1893, 56-57 Vict., c. 14 (U.K.) by repealing the words after “of the census” to “seventy-one and” and the word “subsequent”.<br><br>By the British North America Act, 1943, 6-7 Geo. VI, c. 30 (U.K.), which Act was repealed by the Constitution Act, 1982, redistribution of seats following the 1941 census was postponed until the first session of Parliament after the war. The section was re-enacted by the British North America Act, 1946, 9-10 Geo. VI, c. 63 (U.K.), which Act was also repealed by the Constitution Act, 1982, to read as follows:</b><br><br>&ensp;<b>51.</b>(1) The number of members of the House of Commons shall be two hundred and fifty-five and the representation of the provinces therein shall forthwith upon the coming into force of this section and thereafter on the completion of each decennial census be readjusted by such authority, in such manner, and from such time as the Parliament of Canada from time to time provides, subject and according to the following rules:<br><br><ol><li>Subject as hereinafter provided, there shall be assigned to each of the provinces a number of members computed by dividing the total population of the provinces by two hundred and fifty-four and by dividing the population of each province by the quotient so obtained, disregarding, except as hereinafter in this section provided, the remainder, if any, after the said process of division.</li><li>If the total number of members assigned to all the provinces pursuant to rule one is less than two hundred and fifty-four, additional members shall be assigned to the provinces (one to a province) having remainders in the computation under rule one commencing with the province having the largest remainder and continuing with the other provinces in the order of the magnitude of their respective remainders until the total number of members assigned is two hundred and fifty-four.</li><li>Notwithstanding anything in this section, if upon completion of a computation under rules one and two, the number of members to be assigned to a province is less than the number of senators representing the said province, rules one and two shall cease to apply in respect of the said province, and there shall be assigned to the said province a number of members equal to the said number of senators.</li><li>In the event that rules one and two cease to apply in respect of a province then, for the purpose of computing the number of members to be assigned to the provinces in respect of which rules one and two continue to apply, the total population of the provinces shall be reduced by the number of the population of the province in respect of which rules one and two have ceased to apply and the number two hundred and fifty-four shall be reduced by the number of members assigned to such province pursuant to rule three.</li><li>Such readjustment shall not take effect until the termination of the then existing Parliament.</li></ol>&ensp;(2) The Yukon Territory as constituted by Chapter forty-one of the Statutes of Canada, 1901, together with any Part of Canada not comprised within a province which may from time to time be included therein by the Parliament of Canada for the purposes of representation in Parliament, shall be entitled to one member.<br><br><b>The section was re-enacted as follows by the British North America Act, 1952, S.C. 1952, c. 15 (which Act was also repealed by the Constitution Act, 1982):</b><br><br>&ensp;<b>51.</b>(1) Subject as hereinafter provided, the number of members of the House of Commons shall be two hundred and sixty-three and the representation of the provinces therein shall forthwith upon the coming into force of this section and thereafter on the completion of each decennial census be readjusted by such authority, in such manner, and from such time as the Parliament of Canada from time to time provides, subject and according to the following rules:<br><br><ol><li>There shall be assigned to each of the provinces a number of members computed by dividing the total population of the provinces by two hundred and sixty-one and by dividing the population of each province by the quotient so obtained, disregarding, except as hereinafter in this section provided, the remainder, if any, after the said process of division.</li><li>If the total number of members assigned to all the provinces pursuant to rule one is less than two hundred and sixty-one, additional members shall be assigned to the provinces (one to a province) having remainders in the computation under rule one commencing with the province having the largest remainder and continuing with the other provinces in the order of the magnitude of their respective remainders until the total number of members assigned is two hundred and sixty-one.</li><li>Notwithstanding anything in this section, if upon completion of a computation under rules one and two the number of members to be assigned to a province is less than the number of senators representing the said province, rules one and two shall cease to apply in respect of the said province, and there shall be assigned to the said province a number of members equal to the said number of senators.</li><li>In the event that rules one and two cease to apply in respect of a province then, for the purposes of computing the number of members to be assigned to the provinces in respect of which rules one and two continue to apply, the total population of the provinces shall be reduced by the number of the population of the province in respect of which rules one and two have ceased to apply and the number two hundred and sixty-one shall be reduced by the number of members assigned to such province pursuant to rule three.</li><li>On any such readjustment the number of members for any province shall not be reduced by more than fifteen per cent below the representation to which such province was entitled under rules one to four of this subsection at the last preceding readjustment of the representation of that province, and there shall be no reduction in the representation of any province as a result of which that province would have a smaller number of members than any other province that according to the results of the then last decennial census did not have a larger population; but for the purposes of any subsequent readjustment of representation under this section any increase in the number of members of the House of Commons resulting from the application of this rule shall not be included in the divisor mentioned in rules one to four of this subsection.</li><li>Such readjustment shall not take effect until the termination of the then existing Parliament.</li></ol>&ensp;(2) The Yukon Territory as constituted by chapter forty-one of the statutes of Canada, 1901, shall be entitled to one member, and such other part of Canada not comprised within a province as may from time to time be defined by the Parliament of Canada shall be entitled to one member.<br><br><b>Subsection 51(1) was re-enacted by the Constitution Act, 1974, S.C. 1974-75-76, c. 13, to read as follows:</b><br><br>&ensp;<b>51.</b>(1) The number of members of the House of Commons and the representation of the provinces therein shall upon the coming into force of this subsection and thereafter on the completion of each decennial census be readjusted by such authority, in such manner, and from such time as the Parliament of Canada from time to time provides, subject and according to the following Rules:<br><br><ol><li>There shall be assigned to Quebec seventy-five members in the readjustment following the completion of the decennial census taken in the year 1971, and thereafter four additional members in each subsequent readjustment.</li><li>Subject to Rules 5(2) and (3), there shall be assigned to a large province a number of members equal to the number obtained by dividing the population of the large province by the electoral quotient of Quebec.</li><li>Subject to Rules 5(2) and (3), there shall be assigned to a small province a number of members equal to the number obtained by dividing<br>(a) the sum of the populations, determined according to the results of the penultimate decennial census, of the provinces (other than Quebec) having populations of less than one and a half million, determined according to the results of that census, by the sum of the numbers of members assigned to those provinces in the readjustment following the completion of that census; and<br>(b) the population of the small province by the quotient obtained under paragraph (a).</li><li>Subject to Rules 5(1)(a), (2) and (3), there shall be assigned to an intermediate province a number of members equal to the number obtained<br>(a) by dividing the sum of the populations of the provinces (other than Quebec) having populations of less than one and a half million by the sum of the number of members assigned to those provinces under any of Rules 3, 5(1)(b), (2) and (3);<br>(b) by dividing the population of the intermediate province by the quotient obtained under paragraph (a); and<br>(c) by adding to the number of members assigned to the intermediate province in the readjustment following the completion of the penultimate decennial census one-half of the difference resulting from the subtraction of that number from the quotient obtained under paragraph (b).<br></li><li>(1) On any readjustment,<br>(a) if no province (other than Quebec) has a population of less than one and a half million, Rule 4 shall not be applied and, subject to Rules 5(2) and (3), there shall be assigned to an intermediate province a number of members equal to the number obtained by dividing<br>(i) the sum of the populations, determined according to the results of the penultimate decennial census, of the provinces, (other than Quebec) having populations of not less than one and a half million and not more than two and a half million, determined according to the results of that census, by the sum of the numbers of members assigned to those provinces in the readjustment following the completion of that census, and<br>(ii) the population of the intermediate province by the quotient obtained under subparagraph (i);<br>(b) if a province (other than Quebec) having a population of<br>(i) less than one and a half million, or<br>(ii) not less than one and a half million and not more than two and a half million<br>does not have a population greater than its population determined according to the results of the penultimate decennial census, it shall, subject to Rules 5(2) and (3), be assigned the number of members assigned to it in the readjustment following the completion of that census.<br>(2) On any readjustment,<br>(a) if, under any of Rules 2 to 5(1), the number of members to be assigned to a province (in this paragraph referred to as “the first province”) is smaller than the number of members to be assigned to any other province not having a population greater than that of the first province, those Rules shall not be applied to the first province and it shall be assigned a number of members equal to the largest number of members to be assigned to any other province not having a population greater than that of the first province;<br>(b) if, under any of Rules 2 to 5(1)(a), the number of members to be assigned to a province is smaller than the number of members assigned to it in the readjustment following the completion of the penultimate decennial census, those Rules shall not be applied to it and it shall be assigned the latter number of members;<br>(c) if both paragraphs (a) and (b) apply to a province, it shall be assigned a number of members equal to the greater of the numbers produced under those paragraphs.<br>(3) On any readjustment,<br>(a) if the electoral quotient of a province (in this paragraph referred to as “the first province”) obtained by dividing its population by the number of members to be assigned to it under any of Rules 2 to 5(2) is greater than the electoral quotient of Quebec, those Rules shall not be applied to the first province and it shall be assigned a number of members equal to the number obtained by dividing its population by the electoral quotient of Quebec;<br>(b) if, as a result of the application of Rule 6(2)(a), the number of members assigned to a province under paragraph (a) equals the number of members to be assigned to it under any of Rules 2 to 5(2), it shall be assigned that number of members and paragraph (a) shall cease to apply to that province.<br></li><li>(1) In these Rules,<br>“electoral quotient” means, in respect of a province, the quotient obtained by dividing its population, determined according to the results of the then most recent decennial census, by the number of members to be assigned to it under any of Rules 1 to 5(3) in the readjustment following the completion of that census;<br>“intermediate province” means a province (other than Quebec) having a population greater than its population determined according to the results of the penultimate decennial census but not more than two and a half million and not less than one and a half million;<br>“large province” means a province (other than Quebec) having a population greater than two and a half million;<br>“penultimate decennial census” means the decennial census that preceded the then most recent decennial census;<br>“population” means, except where otherwise specified, the population determined according to the results of the then most recent decennial census;<br>“small province” means a province (other than Quebec) having a population greater than its population determined according to the results of the penultimate decennial census and less than one and half million.<br>(2) For the purposes of these Rules,<br>(a) if any fraction less than one remains upon completion of the final calculation that produces the number of members to be assigned to a province, that number of members shall equal the number so produced disregarding the fraction;<br>(b) if more than one readjustment follows the completion of a decennial census, the most recent of those readjustments shall, upon taking effect, be deemed to be the only readjustment following the completion of that census;<br>(c) a readjustment shall not take effect until the termination of the then existing Parliament.</li></ol><br><b>Subsection 51(1) was re-enacted by the Constitution Act, 1985 (Representation), S.C. 1986, c. 8, Part I, as follows:</b><br><br>&ensp;<b>51.</b>(1) The number of members of the House of Commons and the representation of the provinces therein shall, on the coming into force of this subsection and thereafter on the completion of each decennial census, be readjusted by such authority, in such manner, and from such time as the Parliament of Canada from time to time provides, subject and according to the following rules:<br><br>Rules<br><ol><li>There shall be assigned to each of the provinces a number of members equal to the number obtained by dividing the total population of the provinces by two hundred and seventy-nine and by dividing the population of each province by the quotient so obtained, counting any remainder in excess of 0.50 as one after the said process of division.</li><li>If the total number of members that would be assigned to a province by the application of rule 1 is less than the total number assigned to that province on the date of coming into force of this subsection, there shall be added to the number of members so assigned such number of members as will result in the province having the same number of members as were assigned on that date.</li></ol><hr><b><sup>(28)</sup> As enacted by the Constitution Act, 1999 (Nunavut), S.C. 1998, c. 15, Part 2. Note that the description of the territory of Yukon is now set out in Schedule 1 to the Yukon Act, S.C. 2002, c. 7, which replaced R.S.C. 1985, c. Y-2. Subsection 51(2) was previously amended by the Constitution Act (No. 1), 1975, S.C. 1974-75-76, c. 28, and read as follows:</b><br><br>&ensp;(2) The Yukon Territory as bounded and described in the schedule to chapter Y-2 of the Revised Statutes of Canada, 1970, shall be entitled to one member, and the Northwest Territories as bounded and described in section 2 of chapter N-22 of the Revised Statutes of Canada, 1970, shall be entitled to two members.<hr><b><sup>(29)</sup> As enacted by the Constitution Act, 1915, 5-6 Geo. V, c. 45 (U.K.).</b><hr>"
            },
            {
                "title":"V. PROVINCIAL CONSTITUTIONS",
                "text":"<p style=\"text-align:center\">Executive Power</p><hr><small>Appointment of Lieutenant Governors of Provinces</small><br><br>&ensp;<b>58. </b>For each Province there shall be an Officer, styled the Lieutenant Governor, appointed by the Governor General in Council by Instrument under the Great Seal of Canada.<hr><small>Tenure of Office of Lieutenant Governor</small><br><br>&ensp;<b>59. </b>A Lieutenant Governor shall hold Office during the Pleasure of the Governor General; but any Lieutenant Governor appointed after the Commencement of the First Session of the Parliament of Canada shall not be removeable within Five Years from his Appointment, except for Cause assigned, which shall be communicated to him in Writing within One Month after the Order for his Removal is made, and shall be communicated by Message to the Senate and to the House of Commons within One Week thereafter if the Parliament is then sitting, and if not then within One Week after the Commencement of the next Session of the Parliament.<hr><small>Salaries of Lieutenant Governors</small><br><br>&ensp;<b>60. </b>The Salaries of the Lieutenant Governors shall be fixed and provided by the Parliament of Canada. (30)<hr><small>Oaths, etc., of Lieutenant Governor</small><br><br>&ensp;<b>61. </b>Every Lieutenant Governor shall, before assuming the Duties of his Office, make and subscribe before the Governor General or some Person authorized by him Oaths of Allegiance and Office similar to those taken by the Governor General.<hr><small>Application of Provisions referring to Lieutenant Governor</small><br><br>&ensp;<b>62. </b>The Provisions of this Act referring to the Lieutenant Governor extend and apply to the Lieutenant Governor for the Time being of each Province, or other the Chief Executive Officer or Administrator for the Time being carrying on the Government of the Province, by whatever Title he is designated.<hr><small>Appointment of Executive Officers for Ontario and Quebec</small><br><br>&ensp;<b>63. </b>The Executive Council of Ontario and of Quebec shall be composed of such Persons as the Lieutenant Governor from Time to Time thinks fit, and in the first instance of the following Officers, namely, — the Attorney General, the Secretary and Registrar of the Province, the Treasurer of the Province, the Commissioner of Crown Lands, and the Commissioner of Agriculture and Public Works, with in Quebec the Speaker of the Legislative Council and the Solicitor General. (31)<hr><small>Executive Government of Nova Scotia and New Brunswick</small><br><br>&ensp;<b>64. </b>The Constitution of the Executive Authority in each of the Provinces of Nova Scotia and New Brunswick shall, subject to the Provisions of this Act, continue as it exists at the Union until altered under the Authority of this Act. (32)<hr><small>Powers to be exercised by Lieutenant Governor of Ontario or Quebec with Advice, or alone</small><br><br>&ensp;<b>65. </b>All Powers, Authorities, and Functions which under any Act of the Parliament of Great Britain, or of the Parliament of the United Kingdom of Great Britain and Ireland, or of the Legislature of Upper Canada, Lower Canada, or Canada, were or are before or at the Union vested in or exerciseable by the respective Governors or Lieutenant Governors of those Provinces, with the Advice or with the Advice and Consent of the respective Executive Councils thereof, or in conjunction with those Councils, or with any Number of Members thereof, or by those Governors or Lieutenant Governors individually, shall, as far as the same are capable of being exercised after the Union in relation to the Government of Ontario and Quebec respectively, be vested in and shall or may be exercised by the Lieutenant Governor of Ontario and Quebec respectively, with the Advice or with the Advice and Consent of or in conjunction with the respective Executive Councils, or any Members thereof, or by the Lieutenant Governor individually, as the Case requires, subject nevertheless (except with respect to such as exist under Acts of the Parliament of Great Britain, or of the Parliament of the United Kingdom of Great Britain and Ireland,) to be abolished or altered by the respective Legislatures of Ontario and Quebec. (33)<hr><small>Application of Provisions referring to Lieutenant Governor in Council</small><br><br>&ensp;<b>66. </b>The Provisions of this Act referring to the Lieutenant Governor in Council shall be construed as referring to the Lieutenant Governor of the Province acting by and with the Advice of the Executive Council thereof.<hr><small>Administration in Absence, etc., of Lieutenant Governor</small><br><br>&ensp;<b>67. </b>The Governor General in Council may from Time to Time appoint an Administrator to execute the Office and Functions of Lieutenant Governor during his Absence, Illness, or other Inability.<hr><small>Seats of Provincial Governments</small><br><br>&ensp;<b>68. </b>Unless and until the Executive Government of any Province otherwise directs with respect to that Province, the Seats of Government of the Provinces shall be as follows, namely, — of Ontario, the City of Toronto; of Quebec, the City of Quebec; of Nova Scotia, the City of Halifax; and of New Brunswick, the City of Fredericton.<hr><p style=\"text-align:center\">Legislative Power</p><hr><p style=\"text-align:center\"><i>1. Ontario</i></p><br><br><small>Legislature for Ontario</small><br><br>&ensp;<b>69. </b>There shall be a Legislature for Ontario consisting of the Lieutenant Governor and of One House, styled the Legislative Assembly of Ontario.<hr><small>Electoral districts</small><br><br>&ensp;<b>70. </b>The Legislative Assembly of Ontario shall be composed of Eighty-two Members, to be elected to represent the Eighty-two Electoral Districts set forth in the First Schedule to this Act. (34)<hr><p style=\"text-align:center\"><i>2. Quebec</i></p><br><br><small>Legislature for Quebec</small><br><br>&ensp;<b>71. </b>There shall be a Legislature for Quebec consisting of the Lieutenant Governor and of Two Houses, styled the Legislative Council of Quebec and the Legislative Assembly of Quebec. (35)<hr><small>Constitution of Legislative Council</small><br><br>&ensp;<b>72. </b>The Legislative Council of Quebec shall be composed of Twenty-four Members, to be appointed by the Lieutenant Governor, in the Queen’s Name, by Instrument under the Great Seal of Quebec, one being appointed to represent each of the Twenty-four Electoral Divisions of Lower Canada in this Act referred to, and each holding Office for the Term of his Life, unless the Legislature of Quebec otherwise provides under the Provisions of this Act.<hr><small>Qualification of Legislative Councillors</small><br><br>&ensp;<b>73. </b>The Qualifications of the Legislative Councillors of Quebec shall be the same as those of the Senators for Quebec.<hr><small>Resignation, Disqualification, etc.</small><br><br>&ensp;<b>74. </b>The Place of a Legislative Councillor of Quebec shall become vacant in the Cases, mutatis mutandis, in which the Place of Senator becomes vacant.<hr><small>Vacancies</small><br><br>&ensp;<b>75. </b>When a Vacancy happens in the Legislative Council of Quebec by Resignation, Death, or otherwise, the Lieutenant Governor, in the Queen’s Name, by Instrument under the Great Seal of Quebec, shall appoint a fit and qualified Person to fill the Vacancy.<hr><small>Questions as to Vacancies, etc.</small><br><br>&ensp;<b>76. </b>If any Question arises respecting the Qualification of a Legislative Councillor of Quebec, or a Vacancy in the Legislative Council of Quebec, the same shall be heard and determined by the Legislative Council.<hr><small>Speaker of Legislative Council</small><br><br>&ensp;<b>77. </b>The Lieutenant Governor may from Time to Time, by Instrument under the Great Seal of Quebec, appoint a Member of the Legislative Council of Quebec to be Speaker thereof, and may remove him and appoint another in his Stead.<hr><small>Quorum of Legislative Council</small><br><br>&ensp;<b>78. </b>Until the Legislature of Quebec otherwise provides, the Presence of at least Ten Members of the Legislative Council, including the Speaker, shall be necessary to constitute a Meeting for the Exercise of its Powers.<hr><small>Voting in Legislative Council</small><br><br>&ensp;<b>79. </b>Questions arising in the Legislative Council of Quebec shall be decided by a Majority of Voices, and the Speaker shall in all Cases have a Vote, and when the Voices are equal the Decision shall be deemed to be in the Negative.<hr><small>Constitution of Legislative Assembly of Quebec</small><br><br>&ensp;<b>80. </b>The Legislative Assembly of Quebec shall be composed of Sixty-five Members, to be elected to represent the Sixty-five Electoral Divisions or Districts of Lower Canada in this Act referred to, subject to Alteration thereof by the Legislature of Quebec: Provided that it shall not be lawful to present to the Lieutenant Governor of Quebec for Assent any Bill for altering the Limits of any of the Electoral Divisions or Districts mentioned in the Second Schedule to this Act, unless the Second and Third Readings of such Bill have been passed in the Legislative Assembly with the Concurrence of the Majority of the Members representing all those Electoral Divisions or Districts, and the Assent shall not be given to such Bill unless an Address has been presented by the Legislative Assembly to the Lieutenant Governor stating that it has been so passed. (36)<hr><p style=\"text-align:center\"><i>3. Ontario and Quebec</i></p><br><br>&ensp;<b>81. </b>Repealed. (37)<hr><small>Summoning of Legislative Assemblies</small><br><br>&ensp;<b>82. </b>The Lieutenant Governor of Ontario and of Quebec shall from Time to Time, in the Queen’s Name, by Instrument under the Great Seal of the Province, summon and call together the Legislative Assembly of the Province.<hr><small>Restriction on election of Holders of offices</small><br><br>&ensp;<b>83. </b>Until the Legislature of Ontario or of Quebec otherwise provides, a Person accepting or holding in Ontario or in Quebec any Office, Commission, or Employment, permanent or temporary, at the Nomination of the Lieutenant Governor, to which an annual Salary, or any Fee, Allowance, Emolument, or Profit of any Kind or Amount whatever from the Province is attached, shall not be eligible as a Member of the Legislative Assembly of the respective Province, nor shall he sit or vote as such; but nothing in this Section shall make ineligible any Person being a Member of the Executive Council of the respective Province, or holding any of the following Offices, that is to say, the Offices of Attorney General, Secretary and Registrar of the Province, Treasurer of the Province, Commissioner of Crown Lands, and Commissioner of Agriculture and Public Works, and in Quebec Solicitor General, or shall disqualify him to sit or vote in the House for which he is elected, provided he is elected while holding such Office. (38)<hr><small>Continuance of existing Election Laws</small><br><br>&ensp;<b>84. </b>Until the legislatures of Ontario and Quebec respectively otherwise provide, all Laws which at the Union are in force in those Provinces respectively, relative to the following Matters, or any of them, namely, — the Qualifications and Disqualifications of Persons to be elected or to sit or vote as Members of the Assembly of Canada, the Qualifications or Disqualifications of Voters, the Oaths to be taken by Voters, the Returning Officers, their Powers and Duties, the Proceedings at Elections, the Periods during which such Elections may be continued, and the Trial of controverted Elections and the Proceedings incident thereto, the vacating of the Seats of Members and the issuing and execution of new Writs in case of Seats vacated otherwise than by Dissolution, — shall respectively apply to Elections of Members to serve in the respective Legislative Assemblies of Ontario and Quebec.<br>Provided that, until the Legislature of Ontario otherwise provides, at any Election for a Member of the Legislative Assembly of Ontario for the District of Algoma, in addition to Persons qualified by the Law of the Province of Canada to vote, every Male British Subject, aged Twenty-one Years or upwards, being a Householder, shall have a Vote. (39)<hr><small>Duration of Legislative Assemblies</small><br><br>&ensp;<b>85. </b>Every Legislative Assembly of Ontario and every Legislative Assembly of Quebec shall continue for Four Years from the Day of the Return of the Writs for choosing the same (subject nevertheless to either the Legislative Assembly of Ontario or the Legislative Assembly of Quebec being sooner dissolved by the Lieutenant Governor of the Province), and no longer. (40)<hr><small>Yearly Session of Legislature</small><br><br>&ensp;<b>86. </b>There shall be a Session of the Legislature of Ontario and of that of Quebec once at least in every Year, so that Twelve Months shall not intervene between the last Sitting of the Legislature in each Province in one Session and its first Sitting in the next Session. (41)<hr><small>Speaker, Quorum, etc.</small><br><br>&ensp;<b>87. </b>The following Provisions of this Act respecting the House of Commons of Canada shall extend and apply to the Legislative Assemblies of Ontario and Quebec, that is to say, — the Provisions relating to the Election of a Speaker originally and on Vacancies, the Duties of the Speaker, the Absence of the Speaker, the Quorum, and the Mode of voting, as if those Provisions were here re-enacted and made applicable in Terms to each such Legislative Assembly.<hr><p style=\"text-align:center\"><i>4. Nova Scotia and New Brunswick</i></p><small>Constitutions of Legislatures of Nova Scotia and New Brunswick</small><br><br>&ensp;<b>88. </b>The Constitution of the Legislature of each of the Provinces of Nova Scotia and New Brunswick shall, subject to the Provisions of this Act, continue as it exists at the Union until altered under the Authority of this Act. (42)<hr><p style=\"text-align:center\"><i>5. Ontario, Quebec, and Nova Scotia</i></p>&ensp;<b>89. </b>Repealed. (43)<hr><p style=\"text-align:center\"><i>6. The Four Provinces</i></p><small>Application to Legislatures of Provisions respecting Money Votes, etc.</small><br><br>&ensp;<b>90. </b>The following Provisions of this Act respecting the Parliament of Canada, namely, — the Provisions relating to Appropriation and Tax Bills, the Recommendation of Money Votes, the Assent to Bills, the Disallowance of Acts, and the Signification of Pleasure on Bills reserved, — shall extend and apply to the Legislatures of the several Provinces as if those Provisions were here re-enacted and made applicable in Terms to the respective Provinces and the Legislatures thereof, with the Substitution of the Lieutenant Governor of the Province for the Governor General, of the Governor General for the Queen and for a Secretary of State, of One Year for Two Years, and of the Province for Canada.<hr>",
                "notes":"<b><sup>(30)</sup> Provided for by the Salaries Act, R.S.C. 1985, c. S-3.</b><hr><b><sup>(31)</sup> Now provided for in Ontario by the Executive Council Act, R.S.O. 1990, c. E.25, and in Quebec by the Executive Power Act, R.S.Q., c. E-18.</b><hr><b><sup>(32)</sup> A similar provision was included in each of the instruments admitting British Columbia, Prince Edward Island, and Newfoundland. The Executive Authorities for Manitoba, Alberta and Saskatchewan were established by the statutes creating those provinces. See footnote (6) to section 5, above.</b><hr><b><sup>(33)</sup> See footnote (65) to section 129</b><hr><b><sup>(34)</sup> Spent. Now covered by the Representation Act, 2005, S.O. 2005, c. 35, Schedule 1.</b><hr><b><sup>(35)</sup> An Act respecting the Legislative Council of Quebec, S.Q. 1968, c. 9, provided that the Legislature for Quebec shall consist of the Lieutenant Governor and the National Assembly of Quebec, and repealed the provisions of the Legislature Act, R.S.Q. 1964, c. 6, relating to the Legislative Council of Quebec. Now covered by the National Assembly Act, R.S.Q. c. A-23.1. Sections 72 to 79 following are therefore completely spent.</b><hr><b><sup>(36)</sup> An Act respecting the electoral districts, S.Q. 1970, c. 7, provides that this section no longer has effect.</b><hr><b><sup>(37)</sup> Repealed by the Statute Law Revision Act, 1893, 56-57 Vict., c. 14 (U.K.). The section read as follows:</b>&ensp;<b>81. </b>The Legislatures of Ontario and Quebec respectively shall be called together not later than Six Months after the Union.<hr><b><sup>(38)</sup> Probably spent. The subject-matter of this section is now covered in Ontario by the Legislative Assembly Act, R.S.O. 1990, c. L.10, and in Quebec by the National Assembly Act, R.S.Q. c. A-23.1.</b><hr><b><sup>(39)</sup> Probably spent. The subject-matter of this section is now covered in Ontario by the Election Act, R.S.O. 1990, c. E.6, and the Legislative Assembly Act, R.S.O. 1990, c. L.10, and in Quebec by the Election Act, R.S.Q. c. E-3.3 and the National Assembly Act, R.S.Q. c. A-23.1.</b><hr><b><sup>(40)</sup> The maximum duration of the Legislative Assembly of Quebec has been changed to five years. See the National Assembly Act, R.S.Q. c. A-23.1. See also section 4 of the Constitution Act, 1982, which provides a maximum duration for a legislative assembly of five years but also authorizes continuation in special circumstances.</b><hr><b><sup>(41)</sup>  See also section 5 of the Constitution Act, 1982, which provides that there shall be a sitting of each legislature at least once every twelve months.</b><hr><b><sup>(42)</sup> Partially repealed by the Statute Law Revision Act, 1893, 56-57 Vict., c. 14 (U.K.), which deleted the following concluding words of the original enactment:</b><br>and the House of Assembly of New Brunswick existing at the passing of this Act shall, unless soooner dissolved, continue for the Period for which it was elected.<br><b>A similar provision was included in each of the instruments admitting British Columbia, Prince Edward Island and Newfoundland. The Legislatures of Manitoba, Alberta and Saskatchewan were established by the statutes creating those provinces. See footnote (6) to section 5, above.<br>See also sections 3 to 5 of the Constitution Act, 1982, which prescribe democratic rights applicable to all provinces, and subitem 2(2) of the Schedule to that Act, which sets out the repeal of section 20 of the Manitoba Act, 1870. Section 20 of the Manitoba Act, 1870 has been replaced by section 5 of the Constitution Act, 1982. Section 20 read as follows:</b><br>&ensp;<b>20. </b>There shall be a Session of the Legislature once at least in every year, so that twelve months shall not intervene between the last sitting of the Legislature in one Session and its first sitting in the next Session.<hr><b><sup>(43)</sup> Repealed by the Statute Law Revision Act, 1893, 56-57 Vict., c. 14 (U.K.). The section read as follows:</b><br>&ensp;<b>89. </b>Each of the Lieutenant Governors of Ontario, Quebec and Nova Scotia shall cause Writs to be issued for the First Election of Members of the Legislative Assembly thereof in such Form and by such Person as he thinks fit, and at such Time and addressed to such Returning Officer as the Governor General directs, and so that the First Election of Member of Assembly for any Electoral District or any Subdivision thereof shall be held at the same Time and at the same Places as the Election for a Member to serve in the House of Commons of Canada for that Electoral District.<hr>"
            },
            {
                "title":"VI. DISTRIBUTION OF LEGISLATIVE POWERS",
                "text":"<p style=\"text-align:center\">Powers of the Parliament</p><small>Legislative Authority of Parliament of Canada</small><br><br>&ensp;<b>91. </b>It shall be lawful for the Queen, by and with the Advice and Consent of the Senate and House of Commons, to make Laws for the Peace, Order, and good Government of Canada, in relation to all Matters not coming within the Classes of Subjects by this Act assigned exclusively to the Legislatures of the Provinces; and for greater Certainty, but not so as to restrict the Generality of the foregoing Terms of this Section, it is hereby declared that (notwithstanding anything in this Act) the exclusive Legislative Authority of the Parliament of Canada extends to all Matters coming within the Classes of Subjects next hereinafter enumerated; that is to say,<br><ol><li>Repealed. (44)<br>1A. The Public Debt and Property. (45)</li><li>The Regulation of Trade and Commerce.<br>2A. Unemployment insurance. (46)</li><li>The raising of Money by any Mode or System of Taxation.</li><li>The borrowing of Money on the Public Credit.</li><li>Postal Service.</li><li>The Census and Statistics.</li><li>Militia, Military and Naval Service, and Defence.</li><li>The fixing of and providing for the Salaries and Allowances of Civil and other Officers of the Government of Canada.</li><li>Beacons, Buoys, Lighthouses, and Sable Island.</li><li>Navigation and Shipping.</li><li>Quarantine and the Establishment and Maintenance of Marine Hospitals.</li><li>Sea Coast and Inland Fisheries.</li><li>Ferries between a Province and any British or Foreign Country or between Two Provinces.</li><li>Currency and Coinage.</li><li>Banking, Incorporation of Banks, and the Issue of Paper Money.</li><li>Savings Banks.</li><li>Weights and Measures.</li><li>Bills of Exchange and Promissory Notes.</li><li>Interest.</li><li>Legal Tender.</li><li>Bankruptcy and Insolvency.</li><li>Patents of Invention and Discovery.</li><li>Copyrights.</li><li>Indians, and Lands reserved for the Indians.</li><li>Naturalization and Aliens.</li><li>Marriage and Divorce.</li><li>The Criminal Law, except the Constitution of Courts of Criminal Jurisdiction, but including the Procedure in Criminal Matters.</li><li>The Establishment, Maintenance, and Management of Penitentiaries.</li><li>Such Classes of Subjects as are expressly excepted in the Enumeration of the Classes of Subjects by this Act assigned exclusively to the Legislatures of the Provinces.</li></ol>And any Matter coming within any of the Classes of Subjects enumerated in this Section shall not be deemed to come within the Class of Matters of a local or private Nature comprised in the Enumeration of the Classes of Subjects by this Act assigned exclusively to the Legislatures of the Provinces. (47)<hr><p style=\"text-align:center\">Exclusive Powers of Provincial Legislatures</p><hr><small>Subjects of exclusive Provincial Legislation</small><br><br>&ensp;<b>92. </b>In each Province the Legislature may exclusively make Laws in relation to Matters coming within the Classes of Subjects next hereinafter enumerated; that is to say,<br><ol><li> Repealed. (48)</li><li>Direct Taxation within the Province in order to the raising of a Revenue for Provincial Purposes.</li><li>The borrowing of Money on the sole Credit of the Province.</li><li>The Establishment and Tenure of Provincial Offices and the Appointment and Payment of Provincial Officers.</li><li>The Management and Sale of the Public Lands belonging to the Province and of the Timber and Wood thereon.</li><li>The Establishment, Maintenance, and Management of Public and Reformatory Prisons in and for the Province.</li><li>The Establishment, Maintenance, and Management of Hospitals, Asylums, Charities, and Eleemosynary Institutions in and for the Province, other than Marine Hospitals.</li><li>Municipal Institutions in the Province.</li><li>Shop, Saloon, Tavern, Auctioneer, and other Licences in order to the raising of a Revenue for Provincial, Local, or Municipal Purposes.</li><li>Local Works and Undertakings other than such as are of the following Classes:<br>(a) Lines of Steam or other Ships, Railways, Canals, Telegraphs, and other Works and Undertakings connecting the Province with any other or others of the Provinces, or extending beyond the Limits of the Province:<br>(b) Lines of Steam Ships between the Province and any British or Foreign Country:<br>(c) Such Works as, although wholly situate within the Province, are before or after their Execution declared by the Parliament of Canada to be for the general Advantage of Canada or for the Advantage of Two or more of the Provinces.</li><li>The Incorporation of Companies with Provincial Objects.</li><li>The Solemnization of Marriage in the Province.</li><li>Property and Civil Rights in the Province.</li><li>The Administration of Justice in the Province, including the Constitution, Maintenance, and Organization of Provincial Courts, both of Civil and of Criminal Jurisdiction, and including Procedure in Civil Matters in those Courts.</li><li>The Imposition of Punishment by Fine, Penalty, or Imprisonment for enforcing any Law of the Province made in relation to any Matter coming within any of the Classes of Subjects enumerated in this Section.</li><li>Generally all Matters of a merely local or private Nature in the Province.</li></ol><hr><p style=\"text-align:center\">Non-Renewable Natural Resources, Forestry Resources and Electrical Energy</p><hr><small>Laws respecting non-renewable natural resources, forestry resources and electrical energy</small><br><br>&ensp;<b>92A. </b>(1) In each province, the legislature may exclusively make laws in relation to<br>(a) exploration for non-renewable natural resources in the province;<br>(b) development, conservation and management of non-renewable natural resources and forestry resources in the province, including laws in relation to the rate of primary production therefrom; and<br>(c) development, conservation and management of sites and facilities in the province for the generation and production of electrical energy.<hr><small>Export from provinces of resources</small><br><br>&ensp;(2) In each province, the legislature may make laws in relation to the export from the province to another part of Canada of the primary production from non-renewable natural resources and forestry resources in the province and the production from facilities in the province for the generation of electrical energy, but such laws may not authorize or provide for discrimination in prices or in supplies exported to another part of Canada.<hr><small>Authority of Parliament</small><br><br>&ensp;(3) Nothing in subsection (2) derogates from the authority of Parliament to enact laws in relation to the matters referred to in that subsection and, where such a law of Parliament and a law of a province conflict, the law of Parliament prevails to the extent of the conflict.<hr><small>Taxation of resources</small><br><br>&ensp;(4) In each province, the legislature may make laws in relation to the raising of money by any mode or system of taxation in respect of<br>(a) non-renewable natural resources and forestry resources in the province and the primary production therefrom, and<br>(b) sites and facilities in the province for the generation of electrical energy and the production therefrom,<br>whether or not such production is exported in whole or in part from the province, but such laws may not authorize or provide for taxation that differentiates between production exported to another part of Canada and production not exported from the province.<hr><small>\"Primary production\"</small><br><br>&ensp;(5) The expression \"primary production\" has the meaning assigned by the Sixth Schedule.<hr><small>Existing powers or rights</small><br><br>&ensp;(6) Nothing in subsections (1) to (5) derogates from any powers or rights that a legislature or government of a province had immediately before the coming into force of this section. (49)<hr><p style=\"text-align:center\">Education</p><hr><small>Legislation respecting Education</small><br><br>&ensp;<b>93. </b>In and for each Province the Legislature may exclusively make Laws in relation to Education, subject and according to the following Provisions:<ol><li>Nothing in any such Law shall prejudicially affect any Right or Privilege with respect to Denominational Schools which any Class of Persons have by Law in the Province at the Union;</li><li>All the Powers, Privileges, and Duties at the Union by Law conferred and imposed in Upper Canada on the Separate Schools and School Trustees of the Queen’s Roman Catholic Subjects shall be and the same are hereby extended to the Dissentient Schools of the Queen’s Protestant and Roman Catholic Subjects in Quebec;</li><li>Where in any Province a System of Separate or Dissentient Schools exists by Law at the Union or is thereafter established by the Legislature of the Province, an Appeal shall lie to the Governor General in Council from any Act or Decision of any Provincial Authority affecting any Right or Privilege of the Protestant or Roman Catholic Minority of the Queen’s Subjects in relation to Education;</li><li>In case any such Provincial Law as from Time to Time seems to the Governor General in Council requisite for the due Execution of the Provisions of this Section is not made, or in case any Decision of the Governor General in Council on any Appeal under this Section is not duly executed by the proper Provincial Authority in that Behalf, then and in every such Case, and as far only as the Circumstances of each Case require, the Parliament of Canada may make remedial Laws for the due Execution of the Provisions of this Section and of any Decision of the Governor General in Council under this Section. (50)</li></ol><hr><small>Quebec</small><br><br>&ensp;<b>93A. </b>Paragraphs (1) to (4) of section 93 do not apply to Quebec. (51)<hr><p style=\"text-align:center\">Uniformity of Laws in Ontario,  Nova Scotia, and New Brunswick</p><hr><small>Legislation for Uniformity of Laws in Three Provinces</small><br><br>&ensp;<b>94. </b>Notwithstanding anything in this Act, the Parliament of Canada may make Provision for the Uniformity of all or any of the Laws relative to Property and Civil Rights in Ontario, Nova Scotia, and New Brunswick, and of the Procedure of all or any of the Courts in those Three Provinces, and from and after the passing of any Act in that Behalf the Power of the Parliament of Canada to make Laws in relation to any Matter comprised in any such Act shall, notwithstanding anything in this Act, be unrestricted; but any Act of the Parliament of Canada making Provision for such Uniformity shall not have effect in any Province unless and until it is adopted and enacted as Law by the Legislature thereof.<hr><p style=\"text-align:center\">Old Age Pensions</p><hr><small>Legislation respecting old age pensions and supplementary benefits</small><br><br>&ensp;<b>94A. </b>The Parliament of Canada may make laws in relation to old age pensions and supplementary benefits, including survivors’ and disability benefits irrespective of age, but no such law shall affect the operation of any law present or future of a provincial legislature in relation to any such matter. (52)<hr><p style=\"text-align:center\">Agriculture and Immigration</p><hr><small>Concurrent Powers of Legislation respecting Agriculture, etc.</small><br><br>&ensp;<b>95. </b>In each Province the Legislature may make Laws in relation to Agriculture in the Province, and to Immigration into the Province; and it is hereby declared that the Parliament of Canada may from Time to Time make Laws in relation to Agriculture in all or any of the Provinces, and to Immigration into all or any of the Provinces; and any Law of the Legislature of a Province relative to Agriculture or to Immigration shall have effect in and for the Province as long and as far only as it is not repugnant to any Act of the Parliament of Canada.<hr>",
                "notes":"<b><sup>(44)</sup> A new class 1 was added by the British North America (No. 2) Act, 1949, 13 Geo. VI, c. 81 (U.K.). That Act and class 1 were repealed by the Constitution Act, 1982. The matters referred to in class 1 are provided for in subsection 4(2) and Part V of the Constitution Act, 1982. As enacted, class 1 read as follows:</b><br><ol><li>The amendment from time to time of the Constitution of Canada, except as regards matters coming within the classes of subjects by this Act assigned exclusively to the Legislatures of the provinces, or as regards rights or privileges by this or any other Constitutional Act granted or secured to the Legislature or the Government of a province, or to any class of persons with respect to schools or as regards the use of the English or the French language or as regards the requirements that there shall be a session of the Parliament of Canada at least once each year, and that no House of Commons shall continue for more than five years from the day of the return of the Writs for choosing the House: provided, however, that a House of Commons may in time of real or apprehended war, invasion or insurrection be continued by the Parliament of Canada if such continuation is not opposed by the votes of more than one-third of the members of such House.</li></ol><hr><b><sup>(45)</sup> The original class 1 was re-numbered by the British North America (No. 2) Act, 1949, 13 Geo. VI, c. 81 (U.K.), as class 1A.</b><hr><b><sup>(46)</sup> Added by the Constitution Act, 1940, 3-4 Geo. VI, c. 36 (U.K.).</b><hr><b><sup>(47)</sup> Legislative authority has been conferred on Parliament by other Acts.<br>Acts conferring legislative authority on Parliament:<br><ol><li>The Constitution Act, 1871, 34-35 Vict., c. 28 (U.K.):</li></b><li>The Parliament of Canada may from time to time establish new Provinces in any territories forming for the time being part of the Dominion of Canada, but not included in any Province thereof, and may, at the time of such establishment, make provision for the constitution and administration of any such Province, and for the passing of laws for the peace, order, and good government of such Province, and for its representation in the said Parliament.</li><li>The Parliament of Canada may from time to time, with the consent of the Legislature of any province of the said Dominion, increase, diminish, or otherwise alter the limits of such Province, upon such terms and conditions as may be agreed to by the said Legislature, and may, with the like consent, make provision respecting the effect and operation of any such increase or diminution or alteration of territory in relation to any Province affected thereby.</li><li>The Parliament of Canada may from time to time make provision for the administration, peace, order, and good government of any territory not for the time being included in any Province.</li><li>The following Acts passed by the said Parliament of Canada, and intituled respectively, — “An Act for the temporary government of Rupert’s Land and the North Western Territory when united with Canada”; and “An Act to amend and continue the Act thirty-two and thirty-three Victoria, chapter three, and to establish and provide for the government of “the Province of Manitoba”, shall be and be deemed to have been valid and effectual for all purposes whatsoever from the date at which they respectively received the assent, in the Queen’s name, of the Governor General of the said Dominion of Canada.</li><li>Except as provided by the third section of this Act, it shall not be competent for the Parliament of Canada to alter the provisions of the last-mentioned Act of the said Parliament in so far as it relates to the Province of Manitoba, or of any other Act hereafter establishing new Provinces in the said Dominion, subject always to the right of the Legislature of the Province of Manitoba to alter from time to time the provisions of any law respecting the qualification of electors and members of the Legislative Assembly, and to make laws respecting elections in the said Province.</li></ol><b>The Rupert’s Land Act, 1868, 31-32 Vict., c. 105 (U.K.) (repealed by the Statute Law Revision Act, 1893, 56-57 Vict., c. 14 (U.K.)), had previously conferred similar authority in relation to Rupert’s Land and the North-Western Territory upon admission of those areas.</b><br><b>2. The Constitution Act, 1886, 49-50 Vict., c. 35 (U.K.):</b><br>&ensp;1. The Parliament of Canada may from time to time make provision for the representation in the Senate and House of Commons of Canada, or in either of them, of any territories which for the time being form part of the Dominion of Canada, but are not included in any province thereof.<br><b>3. The Statute of Westminster, 1931, 22 Geo. V, c. 4 (U.K.):</b><br>&ensp;3. It is hereby declared and enacted that the Parliament of a Dominion has full power to make laws having extra-territorial operation.<b>4. Under section 44 of the Constitution Act, 1982, Parliament has exclusive authority to amend the Constitution of Canada in relation to the executive government of Canada or the Senate and House of Commons. Sections 38, 41, 42 and 43 of that Act authorize the Senate and House of Commons to give their approval to certain other constitutional amendments by resolution.</b><hr><b><sup>(48)</sup> Class 1 was repealed by the Constitution Act, 1982. As enacted, it read as follows:</b><br><ol><li>The Amendment from Time to Time, notwithstanding anything in this Act, of the Constitution of the Province, except as regards the Office of Lieutenant Governor.</li></ol><br><b>Section 45 of the Constitution Act, 1982 now authorizes legislatures to make laws amending the constitution of the province. Sections 38, 41, 42 and 43 of that Act authorize legislative assemblies to give their approval by resolution to certain other amendments to the Constitution of Canada.</b><hr><b><sup>(49)</sup> Added by section 50 of the Constitution Act, 1982.</b><hr><b><sup>(50)</sup> Alternative provisions have been enacted for four provinces.<br>An alternative was provided for Manitoba by section 22 of the Manitoba Act, 1870, 33 Vict., c. 3 (confirmed by the Constitution Act, 1871, 34-35 Vict., c. 28 (U.K.)), which section reads as follows:</b><br>&ensp;<b>22. </b>In and for the Province, the said Legislature may exclusively make Laws in relation to Education, subject and according to the following provisions:<br><ol><li>Nothing in any such Law shall prejudicially affect any right or privilege with respect to Denominational Schools which any class of persons have by Law or practice in the Province at the Union:</li><li>An appeal shall lie to the Governor General in Council from any Act or decision of the Legislature of the Province, or of any Provincial Authority, affecting any right or privilege, of the Protestant or Roman Catholic minority of the Queen’s subjects in relation to Education:</li><li>In case any such Provincial Law, as from time to time seems to the Governor General in Council requisite for the due execution of the provisions of this section, is not made, or in case any decision of the Governor General in Council on any appeal under this section is not duly executed by the proper Provincial Authority in that behalf, then, and in every such case, and as far only as the circumstances of each case require, the Parliament of Canada may make remedial Laws for the due execution of the provisions of this section, and of any decision of the Governor General in Council under this section.</li></ol><br><b>An alternative was provided for Alberta by section 17 of the Alberta Act, 1905, 4-5 Edw. VII, c. 3, which section reads as follows:</b><br>&ensp;<b>17. </b>Section 93 of the Constitution Act, 1867, shall apply to the said province, with the substitution for paragraph (1) of the said section 93 of the following paragraph:<br><ol><li>Nothing in any such law shall prejudicially affect any right or privilege with respect to separate schools which any class of persons have at the date of the passing of this Act, under the terms of chapters 29 and 30 of the Ordinances of the Northwest Territories, passed in the year 1901, or with respect to religious instruction in any public or separate school as provided for in the said ordinances.</li><li> In the appropriation by the Legislature or distribution by the Government of the province of any moneys for the support of schools organized and carried on in accordance with the said chapter 29 or any Act passed in amendment thereof, or in substitution therefor, there shall be no discrimination against schools of any class described in the said chapter 29.</li><li> Where the expression “by law” is employed in paragraph 3 of the said section 93, it shall be held to mean the law as set out in the said chapters 29 and 30, and where the expression “at the Union” is employed, in the said paragraph 3, it shall be held to mean the date at which this Act comes into force.</li></ol><br><b>An alternative was provided for Saskatchewan by section 17 of the Saskatchewan Act, 1905, 4-5 Edw. VII, c. 42, which section reads as follows:</b><br>&ensp;<b>17. </b>Section 93 of the Constitution Act, 1867, shall apply to the said province, with the substitution for paragraph (1) of the said section 93, of the following paragraph:<br><ol><li>Nothing in any such law shall prejudicially affect any right or privilege with respect to separate schools which any class of persons have at the date of the passing of this Act, under the terms of chapters 29 and 30 of the Ordinances of the Northwest Territories, passed in the year 1901, or with respect to religious instruction in any public or separate school as provided for in the said ordinances.</li><li> In the appropriation by the Legislature or distribution by the Government of the province of any moneys for the support of schools organized and carried on in accordance with the said chapter 29, or any Act passed in amendment thereof or in substitution therefor, there shall be no discrimination against schools of any class described in the said chapter 29.</li><li> Where the expression “by law” is employed in paragraph (3) of the said section 93, it shall be held to mean the law as set out in the said chapters 29 and 30; and where the expression “at the Union” is employed in the said paragraph (3), it shall be held to mean the date at which this Act comes into force.</li></ol><br><b>An alternative was provided for Newfoundland by Term 17 of the Terms of Union of Newfoundland with Canada (confirmed by the Newfoundland Act, 12-13 Geo. VI, c. 22 (U.K.)). Term 17 of the Terms of Union of Newfoundland with Canada, set out in the penultimate paragraph of this note, was amended by the Constitution Amendment, 1998 (Newfoundland Act) (see SI/98-25) and the Constitution Amendment, 2001 (Newfoundland and Labrador) (see SI/2001-117), and now reads as follows:</b><br><b>17.</b><br><ol><li>In lieu of section ninety-three of the Constitution Act, 1867, this term shall apply in respect of the Province of Newfoundland and Labrador.</li><li>In and for the Province of Newfoundland and Labrador, the Legislature shall have exclusive authority to make laws in relation to education, but shall provide for courses in religion that are not specific to a religious denomination.</li><li>Religious observances shall be permitted in a school where requested by parents.</li></ol><br><b>Prior to the Constitution Amendment, 1998 (Newfoundland Act), Term 17 of the Terms of Union of Newfoundland with Canada had been amended by the Constitution Amendment, 1997 (Newfoundland Act) (see SI/97-55) to read as follows:</b><br>17. In lieu of section ninety-three of the Constitution Act, 1867, the following shall apply in respect of the Province of Newfoundland:<br>In and for the Province of Newfoundland, the Legislature shall have exclusive authority to make laws in relation to education but<br>(a) except as provided in paragraphs (b) and (c), schools established, maintained and operated with public funds shall be denominational schools, and any class of persons having rights under this Term as it read on January 1, 1995 shall continue to have the right to provide for religious education, activities and observances for the children of that class in those schools, and the group of classes that formed one integrated school system by agreement in 1969 may exercise the same rights under this Term as a single class of persons;<br>(b) subject to provincial legislation that is uniformly applicable to all schools specifying conditions for the establishment or continued operation of schools,<br>&ensp;(i) any class of persons referred to in paragraph (a) shall have the right to have a publicly funded denominational school established, maintained and operated especially for that class, and<br>&ensp;(ii) the Legislature may approve the establishment, maintenance and operation of a publicly funded school, whether denominational or non-denominational;<br>(c) where a school is established, maintained and operated pursuant to subparagraph (b)(i), the class of persons referred to in that subparagraph shall continue to have the right to provide for religious education, activities and observances and to direct the teaching of aspects of curriculum affecting religious beliefs, student admission policy and the assignment and dismissal of teachers in that school;<br>(d) all schools referred to in paragraphs (a) and (b) shall receive their share of public funds in accordance with scales determined on a non-discriminatory basis from time to time by the Legislature; and<br>(e) if the classes of persons having rights under this Term so desire, they shall have the right to elect in total not less than two thirds of the members of a school board, and any class so desiring shall have the right to elect the portion of that total that is proportionate to the population of that class in the area under the board’s jurisdiction.<br><b>Prior to the Constitution Amendment, 1997 (Newfoundland Act), Term 17 of the Terms of Union of Newfoundland with Canada had been amended by the Constitution Amendment, 1987 (Newfoundland Act) (see SI/88-11) to read as follows:</b><br><b>17.</b><br>(1) In lieu of section ninety-three of the Constitution Act, 1867, the following term shall apply in respect of the Province of Newfoundland:<br>In and for the Province of Newfoundland the Legislature shall have exclusive authority to make laws in relation to education, but the Legislature will not have authority to make laws prejudicially affecting any right or privilege with respect to denominational schools, common (amalgamated) schools, or denominational colleges, that any class or classes of persons have by law in Newfoundland at the date of Union, and out of public funds of the Province of Newfoundland, provided for education,<br>&ensp;(a) all such schools shall receive their share of such funds in accordance with scales determined on a non-discriminatory basis from time to time by the Legislature for all schools then being conducted under authority of the Legislature; and<br>&ensp;(b) all such colleges shall receive their share of any grant from time to time voted for all colleges then being conducted under authority of the Legislature, such grant being distributed on a non-discriminatory basis.<br>(2) For the purposes of paragraph one of this Term, the Pentecostal Assemblies of Newfoundland have in Newfoundland all the same rights and privileges with respect to denominational schools and denominational colleges as any other class or classes of persons had by law in Newfoundland at the date of Union, and the words “all such schools” in paragraph (a) of paragraph one of this Term and the words “all such colleges” in paragraph (b) of paragraph one of this Term include, respectively, the schools and the colleges of the Pentecostal Assemblies of Newfoundland.<br><b>Term 17 of the Terms of Union of Newfoundland with Canada (confirmed by the Newfoundland Act, 12-13 Geo. VI, c. 22 (U.K.)), which Term provided an alternative for Newfoundland, originally read as follows:</b><br>17. In lieu of section ninety-three of the Constitution Act, 1867, the following term shall apply in respect of the Province of Newfoundland:<br>In and for the Province of Newfoundland the Legislature shall have exclusive authority to make laws in relation to education, but the Legislature will not have authority to make laws prejudicially affecting any right or privilege with respect to denominational schools, common (amalgamated) schools, or denominational colleges, that any class or classes of persons have by law in Newfoundland at the date of Union, and out of public funds of the Province of Newfoundland, provided for education,<br>(a) all such schools shall receive their share of such funds in accordance with scales determined on a non-discriminatory basis from time to time by the Legislature for all schools then being conducted under authority of the Legislature; and<br>(b) all such colleges shall receive their share of any grant from time to time voted for all colleges then being conducted under authority of the Legislature, such grant being distributed on a non-discriminatory basis.<br><b>See also sections 23, 29 and 59 of the Constitution Act, 1982. Section 23 provides for new minority language educational rights and section 59 permits a delay in respect of the coming into force in Quebec of one aspect of those rights. Section 29 provides that nothing in the Canadian Charter of Rights and Freedoms abrogates or derogates from any rights or privileges guaranteed by or under the Constitution of Canada in respect of denominational, separate or dissentient schools.</b><hr><b><sup>(51)</sup> Added by the Constitution Amendment, 1997 (Quebec) (see SI/97-141).</b><hr><b><sup>(52)</sup> Amended by the Constitution Act, 1964, 12-13 Eliz. II, c. 73 (U.K.). As originally enacted by the British North America Act, 1951, 14-15 Geo. VI, c. 32 (U.K.), which was repealed by the Constitution Act, 1982, section 94A read as follows:</b><br>&ensp;<b>94A. </b>It is hereby declared that the Parliament of Canada may from time to time make laws in relation to old age pensions in Canada, but no law made by the Parliament of Canada in relation to old age pensions shall affect the operation of any law present or future of a Provincial Legislature in relation to old age pensions.<hr>"
            },
            {
                "title":"VII. JUDICATURE",
                "text":"<small>Appointment of Judges</small><br><br>&ensp;<b>96. </b>The Governor General shall appoint the Judges of the Superior, District, and County Courts in each Province, except those of the Courts of Probate in Nova Scotia and New Brunswick.<hr><small>Selection of Judges in Ontario, etc.</small><br><br>&ensp;<b>97. </b>Until the Laws relative to Property and Civil Rights in Ontario, Nova Scotia, and New Brunswick, and the Procedure of the Courts in those Provinces, are made uniform, the Judges of the Courts of those Provinces appointed by the Governor General shall be selected from the respective Bars of those Provinces.<hr><small>Selection of Judges in Quebec</small><br><br>&ensp;<b>98. </b>The Judges of the Courts of Quebec shall be selected from the Bar of that Province.<hr><small>Tenure of office of Judges</small><br><br>&ensp;<b>99. </b>(1) Subject to subsection (2) of this section, the judges of the superior courts shall hold office during good behaviour, but shall be removable by the Governor General on address of the Senate and House of Commons.<hr><small>Termination at age 75</small><br><br>&ensp; (2) A judge of a superior court, whether appointed before or after the coming into force of this section, shall cease to hold office upon attaining the age of seventy-five years, or upon the coming into force of this section if at that time he has already attained that age. (53)<hr><small>Salaries, etc., of Judges</small><br><br>&ensp;<b>100. </b>The Salaries, Allowances, and Pensions of the Judges of the Superior, District, and County Courts (except the Courts of Probate in Nova Scotia and New Brunswick), and of the Admiralty Courts in Cases where the Judges thereof are for the Time being paid by Salary, shall be fixed and provided by the Parliament of Canada. (54)<hr><small>General Court of Appeal, etc.</small><br><br>&ensp;<b>101. </b>The Parliament of Canada may, notwithstanding anything in this Act, from Time to Time provide for the Constitution, Maintenance, and Organization of a General Court of Appeal for Canada, and for the Establishment of any additional Courts for the better Administration of the Laws of Canada. (55)<hr>",
                "notes":"<b><sup>(53)</sup> Amended by the Constitution Act, 1960, 9 Eliz. II, c. 2 (U.K.), which came into force on March 1, 1961. The original section read as follows:</b><br><br>&ensp;<b>99. </b>The Judges of the Superior Courts shall hold Office during good Behaviour, but shall be removable by the Governor General on Address of the Senate and House of Commons.<hr><b><sup>(54)</sup> Now provided for in the Judges Act, R.S.C. 1985, c. J-1.</b><hr><b><sup>(55)</sup> See the Supreme Court Act, R.S.C. 1985, c. S-26, the Federal Courts Act, R.S.C. 1985, c. F-7 and the Tax Court of Canada Act, R.S.C. 1985, c. T-2.</b><hr>"
            }
]

