[
    {
        "title":"PART I",
        "text":"<p style=\"text-align:center\">CANADIAN CHARTER OF RIGHTS AND FREEDOMS</p><hr><p> Whereas Canada is founded upon principles that recognize the supremacy of God and the rule of law:</p><br><p style=\"text-align:center\">Guarantee of Rights and Freedoms</p><hr><small>Rights and freedoms in Canada</small><br><br>&ensp;<b>1. </b>The Canadian Charter of Rights and Freedoms guarantees the rights and freedoms set out in it subject only to such reasonable limits prescribed by law as can be demonstrably justified in a free and democratic society.<hr><p style=\"text-align:center\">Fundamental Freedoms</p><hr><small>Fundamental freedoms</small><br><br>&ensp;<b>2. </b>Everyone has the following fundamental freedoms:<br>&ensp;(a) freedom of conscience and religion;<br>&ensp;(b) freedom of thought, belief, opinion and expression, including freedom of the press and other media of communication;<br>&ensp;(c) freedom of peaceful assembly; and<br>&ensp;(d) freedom of association.<hr><br><p style=\"text-align:center\">Democratic Rights</p><hr><small>Democratic rights of citizens</small><br><br>&ensp;<b>3. </b>Every citizen of Canada has the right to vote in an election of members of the House of Commons or of a legislative assembly and to be qualified for membership therein.<hr><small>Maximum duration of legislative bodies</small><br><br>&ensp;<b>4. </b>(1) No House of Commons and no legislative assembly shall continue for longer than five years from the date fixed for the return of the writs at a general election of its members. (81)<hr><small>Continuation in special circumstances</small><br><br>&ensp;(2) In time of real or apprehended war, invasion or insurrection, a House of Commons may be continued by Parliament and a legislative assembly may be continued by the legislature beyond five years if such continuation is not opposed by the votes of more than one-third of the members of the House of Commons or the legislative assembly, as the case may be. (82)<hr><small>Annual sitting of legislative bodies</small><br><br>&ensp;<b>5. </b>There shall be a sitting of Parliament and of each legislature at least once every twelve months. (83)<hr><p style=\"text-align:center\">Mobility Rights</p><hr><small>Mobility of citizens</small><br><br>&ensp;<b>6. </b>(1) Every citizen of Canada has the right to enter, remain in and leave Canada.<hr><small>Rights to move and gain livelihood</small><br><br>&ensp;(2) Every citizen of Canada and every person who has the status of a permanent resident of Canada has the right<br>&ensp;(a) to move to and take up residence in any province; and<br>&ensp;(b) to pursue the gaining of a livelihood in any province.<hr><small>Limitation</small><br><br>&ensp;(3) The rights specified in subsection (2) are subject to<br>&ensp;(a) any laws or practices of general application in force in a province other than those that discriminate among persons primarily on the basis of province of present or previous residence; and<br>&ensp;(b) any laws providing for reasonable residency requirements as a qualification for the receipt of publicly provided social services.<hr><small>Affirmative action programs</small><br><br>&ensp;(4) Subsections (2) and (3) do not preclude any law, program or activity that has as its object the amelioration in a province of conditions of individuals in that province who are socially or economically disadvantaged if the rate of employment in that province is below the rate of employment in Canada.<hr><p style=\"text-align:center\">Legal Rights</p><hr><small>Life, liberty and security of person</small><br><br>&ensp;<b>7. </b>Everyone has the right to life, liberty and security of the person and the right not to be deprived thereof except in accordance with the principles of fundamental justice.<hr><small>Search or seizure</small><br><br>&ensp;<b>8. </b>Everyone has the right to be secure against unreasonable search or seizure.<hr><small>Detention or imprisonment</small><br><br>&ensp;<b>9. </b>Everyone has the right not to be arbitrarily detained or imprisoned.<hr><small>Arrest or detention</small><br><br>&ensp;<b>10. </b>Everyone has the right on arrest or detention<br>&ensp;(a) to be informed promptly of the reasons therefor;<br>&ensp;(b) to retain and instruct counsel without delay and to be informed of that right; and<br>&ensp;(c) to have the validity of the detention determined by way of <i>habeas corpus</i> and to be released if the detention is not lawful.<hr><small>Proceedings in criminal and penal matters</small><br><br>&ensp;<b>11. </b>Any person charged with an offence has the right<br>&ensp;(a) to be informed without unreasonable delay of the specific offence;<br>&ensp;(b) to be tried within a reasonable time;<br>&ensp;(c) not to be compelled to be a witness in proceedings against that person in respect of the offence;<br>&ensp;(d) to be presumed innocent until proven guilty according to law in a fair and public hearing by an independent and impartial tribunal;<br>&ensp;(e) not to be denied reasonable bail without just cause;<br>&ensp;(f) except in the case of an offence under military law tried before a military tribunal, to the benefit of trial by jury where the maximum punishment for the offence is imprisonment for five years or a more severe punishment;<br>&ensp;(g) not to be found guilty on account of any act or omission unless, at the time of the act or omission, it constituted an offence under Canadian or international law or was criminal according to the general principles of law recognized by the community of nations;<br>&ensp;(h) if finally acquitted of the offence, not to be tried for it again and, if finally found guilty and punished for the offence, not to be tried or punished for it again; and<br>&ensp;(i) if found guilty of the offence and if the punishment for the offence has been varied between the time of commission and the time of sentencing, to the benefit of the lesser punishment.<hr><small>Treatment or punishment</small><br><br>&ensp;<b>12. </b>Everyone has the right not to be subjected to any cruel and unusual treatment or punishment.<hr><small>Self-crimination</small><br><br>&ensp;<b>13. </b>A witness who testifies in any proceedings has the right not to have any incriminating evidence so given used to incriminate that witness in any other proceedings, except in a prosecution for perjury or for the giving of contradictory evidence.<hr><small>Interpreter</small><br><br>&ensp;<b>14. </b>A party or witness in any proceedings who does not understand or speak the language in which the proceedings are conducted or who is deaf has the right to the assistance of an interpreter.<hr><p style=\"text-align:center\">Equality Rights</p><hr><small>Equality before and under law and equal protection and benefit of law</small><br><br>&ensp;<b>15. </b>(1) Every individual is equal before and under the law and has the right to the equal protection and equal benefit of the law without discrimination and, in particular, without discrimination based on race, national or ethnic origin, colour, religion, sex, age or mental or physical disability.<hr><small>Affirmative action programs</small><br><br>&ensp;(2) Subsection (1) does not preclude any law, program or activity that has as its object the amelioration of conditions of disadvantaged individuals or groups including those that are disadvantaged because of race, national or ethnic origin, colour, religion, sex, age or mental or physical disability. (84)<hr><p style=\"text-align:center\">Official Languages of Canada</p><hr><small>Official languages of Canada</small><br><br>&ensp;<b>16. </b>(1) English and French are the official languages of Canada and have equality of status and equal rights and privileges as to their use in all institutions of the Parliament and government of Canada.<hr><small>Official languages of New Brunswick</small><br><br>&ensp;(2) English and French are the official languages of New Brunswick and have equality of status and equal rights and privileges as to their use in all institutions of the legislature and government of New Brunswick.<hr><small>Advancement of status and use</small><br><br>&ensp;(3) Nothing in this Charter limits the authority of Parliament or a legislature to advance the equality of status or use of English and French.<hr><small>English and French linguistic communities in New Brunswick</small><br><br>&ensp;<b>16.1 </b>(1) The English linguistic community and the French linguistic community in New Brunswick have equality of status and equal rights and privileges, including the right to distinct educational institutions and such distinct cultural institutions as are necessary for the preservation and promotion of those communities.<hr><small>Role of the legislature and government of New Brunswick</small><br><br>&ensp;(2) The role of the legislature and government of New Brunswick to preserve and promote the status, rights and privileges referred to in subsection (1) is affirmed. (85)<hr><small>Proceedings of Parliament</small><br><br>&ensp;<b>17. </b>(1) Everyone has the right to use English or French in any debates and other proceedings of Parliament. (86)<hr><small>Proceedings of New Brunswick legislature</small><br><br>&ensp;(2) Everyone has the right to use English or French in any debates and other proceedings of the legislature of New Brunswick. (87)<hr><small>Parliamentary statutes and records</small><br><br>&ensp;<b>18. </b>(1) The statutes, records and journals of Parliament shall be printed and published in English and French and both language versions are equally authoritative. (88)<hr><small>New Brunswick statutes and records</small><br><br>&ensp;(2) The statutes, records and journals of the legislature of New Brunswick shall be printed and published in English and French and both language versions are equally authoritative. (89)<hr><small>Proceedings in courts established by Parliament</small><br><br>&ensp;<b>19. </b>(1) Either English or French may be used by any person in, or in any pleading in or process issuing from, any court established by Parliament. (90)<hr><small>Proceedings in New Brunswick courts</small><br><br>&ensp;(2) Either English or French may be used by any person in, or in any pleading in or process issuing from, any court of New Brunswick. (91)<hr><small>Communications by public with federal institutions</small><br><br>&ensp;<b>20. </b>(1) Any member of the public in Canada has the right to communicate with, and to receive available services from, any head or central office of an institution of the Parliament or government of Canada in English or French, and has the same right with respect to any other office of any such institution where<br>&ensp;(a) there is a significant demand for communications with and services from that office in such language; or<br>&ensp;(b) due to the nature of the office, it is reasonable that communications with and services from that office be available in both English and French.<hr><small>Communications by public with New Brunswick institutions</small><br><br>&ensp;(2) Any member of the public in New Brunswick has the right to communicate with, and to receive available services from, any office of an institution of the legislature or government of New Brunswick in English or French.<hr><small>Continuation of existing constitutional provisions</small><br><br>&ensp;<b>21. </b>Nothing in sections 16 to 20 abrogates or derogates from any right, privilege or obligation with respect to the English and French languages, or either of them, that exists or is continued by virtue of any other provision of the Constitution of Canada. (92)<hr><small>Rights and privileges preserved</small><br><br>&ensp;<b>22. </b>Nothing in sections 16 to 20 abrogates or derogates from any legal or customary right or privilege acquired or enjoyed either before or after the coming into force of this Charter with respect to any language that is not English or French.<hr><p style=\"text-align:center\">Minority Language Educational Rights</p><hr><small>Language of instruction</small><br><br>&ensp;<b>23. </b>(1) Citizens of Canada<br>&ensp;(a) whose first language learned and still understood is that of the English or French linguistic minority population of the province in which they reside, or<br>&ensp;(b) who have received their primary school instruction in Canada in English or French and reside in a province where the language in which they received that instruction is the language of the English or French linguistic minority population of the province,<br>have the right to have their children receive primary and secondary school instruction in that language in that province. (93)<hr><small>Continuity of language instruction</small><br><br>&ensp;(2) Citizens of Canada of whom any child has received or is receiving primary or secondary school instruction in English or French in Canada, have the right to have all their children receive primary and secondary school instruction in the same language.<hr><small>Application where numbers warrant</small><br><br>&ensp;(3) The right of citizens of Canada under subsections (1) and (2) to have their children receive primary and secondary school instruction in the language of the English or French linguistic minority population of a province<br>&ensp;(a) applies wherever in the province the number of children of citizens who have such a right is sufficient to warrant the provision to them out of public funds of minority language instruction; and<br>&ensp;(b) includes, where the number of those children so warrants, the right to have them receive that instruction in minority language educational facilities provided out of public funds.<hr><p style=\"text-align:center\">Enforcement</p><hr><small>Enforcement of guaranteed rights and freedoms</small><br><br>&ensp;<b>24. </b>(1) Anyone whose rights or freedoms, as guaranteed by this Charter, have been infringed or denied may apply to a court of competent jurisdiction to obtain such remedy as the court considers appropriate and just in the circumstances.<hr><small>Exclusion of evidence bringing administration of justice into disrepute</small><br><br>&ensp;(2) Where, in proceedings under subsection (1), a court concludes that evidence was obtained in a manner that infringed or denied any rights or freedoms guaranteed by this Charter, the evidence shall be excluded if it is established that, having regard to all the circumstances, the admission of it in the proceedings would bring the administration of justice into disrepute.<hr><p style=\"text-align:center\">General</p><hr><small>Aboriginal rights and freedoms not affected by Charter</small><br><br>&ensp;<b>25. </b>The guarantee in this Charter of certain rights and freedoms shall not be construed so as to abrogate or derogate from any aboriginal, treaty or other rights or freedoms that pertain to the aboriginal peoples of Canada including<br>&ensp;(a) any rights or freedoms that have been recognized by the Royal Proclamation of October 7, 1763; and<br>&ensp;(b) any rights or freedoms that now exist by way of land claims agreements or may be so acquired. (94)<hr><small>Other rights and freedoms not affected by Charter</small><br><br>&ensp;<b>26. </b>The guarantee in this Charter of certain rights and freedoms shall not be construed as denying the existence of any other rights or freedoms that exist in Canada.<hr><small>Multicultural heritage</small><br><br>&ensp;<b>27. </b>This Charter shall be interpreted in a manner consistent with the preservation and enhancement of the multicultural heritage of Canadians.<hr><small>Rights guaranteed equally to both sexes</small><br><br>&ensp;<b>28. </b>Notwithstanding anything in this Charter, the rights and freedoms referred to in it are guaranteed equally to male and female persons.<hr><small>Rights respecting certain schools preserved</small><br><br>&ensp;<b>29. </b>Nothing in this Charter abrogates or derogates from any rights or privileges guaranteed by or under the Constitution of Canada in respect of denominational, separate or dissentient schools. (95)<hr><small>Application to territories and territorial authorities</small><br><br>&ensp;<b>30. </b>A reference in this Charter to a province or to the legislative assembly or legislature of a province shall be deemed to include a reference to the Yukon Territory and the Northwest Territories, or to the appropriate legislative authority thereof, as the case may be.<hr><small>Legislative powers not extended</small><br><br>&ensp;<b>31. </b>Nothing in this Charter extends the legislative powers of any body or authority.<hr><p style=\"text-align:center\">Application of Charter</p><hr><small>Application of Charter</small><br><br>&ensp;<b>32. </b>(1) This Charter applies<br>&ensp;(a) to the Parliament and government of Canada in respect of all matters within the authority of Parliament including all matters relating to the Yukon Territory and Northwest Territories; and<br>&ensp;(b) to the legislature and government of each province in respect of all matters within the authority of the legislature of each province.<hr><small>Exception</small><br><br>&ensp;(2) Notwithstanding subsection (1), section 15 shall not have effect until three years after this section comes into force.<hr><small>Exception where express declaration</small><br><br>&ensp;<b>33. </b>(1) Parliament or the legislature of a province may expressly declare in an Act of Parliament or of the legislature, as the case may be, that the Act or a provision thereof shall operate notwithstanding a provision included in section 2 or sections 7 to 15 of this Charter.<hr><small>Operation of exception</small><br><br>&ensp;(2) An Act or a provision of an Act in respect of which a declaration made under this section is in effect shall have such operation as it would have but for the provision of this Charter referred to in the declaration.<hr><small>Five year limitation</small><br><br>&ensp;(3) A declaration made under subsection (1) shall cease to have effect five years after it comes into force or on such earlier date as may be specified in the declaration.<hr><small>Re-enactment</small><br><br>&ensp;(4) Parliament or the legislature of a province may re-enact a declaration made under subsection (1).<hr><small>Five year limitation</small><br><br>&ensp;(5) Subsection (3) applies in respect of a re-enactment made under subsection (4).<hr><p style=\"text-align:center\">Citation</p><hr><small>Citation</small><br><br>&ensp;<b>34. </b>This Part may be cited as the Canadian Charter of Rights and Freedoms.<hr>",
    "notes":"<b><sup>(80)</sup> Enacted as Schedule B to the Canada Act 1982, 1982, c. 11 (U.K.), which came into force on April 17, 1982. The Canada Act 1982, other than Schedules A and B thereto, reads as follows:</b><br>An Act to give effect to a request by the Senate and House of Commons of Canada<br>Whereas Canada has requested and consented to the enactment of an Act of the Parliament of the United Kingdom to give effect to the provisions hereinafter set forth and the Senate and the House of Commons of Canada in Parliament assembled have submitted an address to Her Majesty requesting that Her Majesty may graciously be pleased to cause a Bill to be laid before the Parliament of the United Kingdom for that purpose.<br>Be it therefore enacted by the Queen’s Most Excellent Majesty, by and with the advice and consent of the Lords Spiritual and Temporal, and Commons, in this present Parliament assembled, and by the authority of the same, as follows:<br><ol><li>The Constitution Act, 1982 set out in Schedule B to this Act is hereby enacted for and shall have the force of law in Canada and shall come into force as provided in that Act.</li><li>No Act of the Parliament of the United Kingdom passed after the Constitution Act, 1982 comes into force shall extend to Canada as part of its law.</li><li>So far as it is not contained in Schedule B, the French version of this Act is set out in Schedule A to this Act and has the same authority in Canada as the English version thereof.</li><li>This Act may be cited as the Canada Act 1982.</li></ol><hr><b><sup>(81)</sup> See section 50, and footnotes (40) and (42) to sections 85 and 88, of the Constitution Act, 1867.</b><hr><b><sup>(82)</sup> Replaces part of Class 1 of section 91 of the Constitution Act, 1867, which was repealed as set out in subitem 1(3) of the schedule to the Constitution Act, 1982.</b><hr><b><sup>(83)</sup> See footnotes (10), (41) and (42) to sections 20, 86 and 88 of the Constitution Act, 1867.</b><hr><b><sup>(84)</sup> Subsection 32(2) provides that section 15 shall not have effect until three years after section 32 comes into force. Section 32 came into force on April 17, 1982; therefore, section 15 had effect on April 17, 1985.</b><hr><b><sup>(85)</sup> Section 16.1 was added by the <i>Constitution Amendment, 1993 (New Brunswick)</i> (see SI/93-54).</b><hr><b><sup>(86)</sup> See section 133 of the Constitution Act, 1867 and footnote (67).</b><hr><b><sup>(87)</sup> Ibid.</b><hr><b><sup>(88)</sup> Ibid.</b><hr><b><sup>(89)</sup> Ibid.</b><hr><b><sup>(90)</sup> Ibid.</b><hr><b><sup>(90)</sup> Ibid.</b><hr><b><sup>(91)</sup> Ibid.</b><hr><b><sup>(92)</sup> See, for example, section 133 of the Constitution Act, 1867 and the reference to the Manitoba Act, 1870 in footnote (67) to that section.</b><hr><b><sup>(93)</sup> Paragraph 23(1)(a) is not in force in respect of Quebec. See section 59, below.</b><hr><b><sup>(94)</sup>Paragraph 25(b) was repealed and re-enacted by the Constitution Amendment Proclamation, 1983 (see SI/84-102). Paragraph 25(b) originally read as follows:</b><br>(b) any rights or freedoms that may be acquired by the aboriginal peoples of Canada by way of land claims settlement.<hr><b><sup>(95)</sup> See section 93 of the Constitution Act, 1867 and footnote (50).</b><hr>"
    },
    {
    "title":"PART II",
    "text":"<p style=\"text-align:center\">RIGHTS OF THE ABORIGINAL PEOPLES OF CANADA</p><hr><small>Recognition of existing aboriginal and treaty rights</small><br><br>&ensp;<b>35. </b>(1) The existing aboriginal and treaty rights of the aboriginal peoples of Canada are hereby recognized and affirmed.<hr><small>Definition of \"aboriginal peoples of Canada\"</small><br><br>&ensp;(2) In this Act, \"aboriginal peoples of Canada\" includes the Indian, Inuit and Métis peoples of Canada.<hr><small>Land claims agreements</small><br><br>&ensp;(3) For greater certainty, in subsection (1) \"treaty rights\" includes rights that now exist by way of land claims agreements or may be so acquired.<hr><small>Aboriginal and treaty rights are guaranteed equally to both sexes</small><br><br>&ensp;(4) Notwithstanding any other provision of this Act, the aboriginal and treaty rights referred to in subsection (1) are guaranteed equally to male and female persons. (96)<hr><small>Commitment to participation in constitutional conference</small><br><br>&ensp;<b>35.1 </b>The government of Canada and the provincial governments are committed to the principle that, before any amendment is made to Class 24 of section 91 of the <i>\"Constitution Act, 1867\"</i>, to section 25 of this Act or to this Part,<br>(a) a constitutional conference that includes in its agenda an item relating to the proposed amendment, composed of the Prime Minister of Canada and the first ministers of the provinces, will be convened by the Prime Minister of Canada; and<br>(b) the Prime Minister of Canada will invite representatives of the aboriginal peoples of Canada to participate in the discussions on that item. (97)<hr>",
    "notes":"<b><sup>(96)</sup> Subsections 35(3) and (4) were added by the Constitution Amendment Proclamation, 1983 (see SI/84-102).</b><hr><b><sup>(97)</sup> Section 35.1 was added by the Constitution Amendment Proclamation, 1983 (see SI/84-102).</b><hr>"
    },
    {

    "title":"PART III",
    "text":"<p style=\"text-align:center\">EQUALIZATION AND REGIONAL DISPARITIES</p><hr><small>Commitment to promote equal opportunities</small><br><br>&ensp;<b>36. </b>(1) Without altering the legislative authority of Parliament or of the provincial legislatures, or the rights of any of them with respect to the exercise of their legislative authority, Parliament and the legislatures, together with the government of Canada and the provincial governments, are committed to<br>&ensp;(a) promoting equal opportunities for the well-being of Canadians;<br>&ensp;(b) furthering economic development to reduce disparity in opportunities; and<br>&ensp;(c) providing essential public services of reasonable quality to all Canadians.<hr><small>Commitment respecting public services</small><br><br>&ensp;(2) Parliament and the government of Canada are committed to the principle of making equalization payments to ensure that provincial governments have sufficient revenues to provide reasonably comparable levels of public services at reasonably comparable levels of taxation. (98)<hr>",
    "notes":"<b><sup>(98)</sup> See footnotes (58) and (59) to sections 114 and 118 of the <i>Constitution Act, 1867</i>.</b><hr>"

    },
    {
    "title":"PART IV",
    "text":"<p style=\"text-align:center\">CONSTITUTIONAL CONFERENCE</p><hr>&ensp;<b>37. </b>Repealed. (99)<hr>",
    "notes":"<b><sup>(99)</sup> Section 54 of the Constitution Act, 1982 provided for the repeal of Part IV (section 37) one year after Part VII came into force. Part VII came into force on April 17, 1982 repealing Part IV on April 17, 1983. Section 37 read as follows:</b><br>&ensp;<b>37. </b>(1) A constitutional conference composed of the Prime Minister of Canada and the first ministers of the provinces shall be convened by the Prime Minister of Canada within one year after this Part comes into force.<br>&ensp;(2) The conference convened under subsection (1) shall have included in its agenda an item respecting constitutional matters that directly affect the aboriginal peoples of Canada, including the identification and definition of the rights of those peoples to be included in the Constitution of Canada, and the Prime Minister of Canada shall invite representatives of those peoples to participate in the discussions on that item.<br>&ensp;(3) The Prime Minister of Canada shall invite elected representatives of the governments of the Yukon Territory and the Northwest Territories to participate in the discussions on any item on the agenda of the conference convened under subsection (1) that, in the opinion of the Prime Minister, directly affects the Yukon Territory and the Northwest Territories.<hr>"

    },
    {
    "title":"PART IV.I",
    "text":"<p style=\"text-align:center\">CONSTITUTIONAL CONFERENCES</p><hr>&ensp;<b>37.1 </b>Repealed. (100)<hr>",
    "notes":"<b><sup>(100)</sup> Part IV.1 (section 37.1), which was added by the Constitution Amendment Proclamation, 1983 (see SI/84-102), was repealed on April 18, 1987 by section 54.1 of the Constitution Act, 1982. Section 37.1 read as follows:</b><br>&ensp;<b>37.1 </b>(1) In addition to the conference convened in March 1983, at least two constitutional conferences composed of the Prime Minister of Canada and the first ministers of the provinces shall be convened by the Prime Minister of Canada, the first within three years after April 17, 1982 and the second within five years after that date.<br>&ensp;(2) Each conference convened under subsection (1) shall have included in its agenda constitutional matters that directly affect the aboriginal peoples of Canada, and the Prime Minister of Canada shall invite representatives of those peoples to participate in the discussions on those matters.<br>&ensp;(3) The Prime Minister of Canada shall invite elected representatives of the governments of the Yukon Territory and the Northwest Territories to participate in the discussions on any item on the agenda of a conference convened under subsection (1) that, in the opinion of the Prime Minister, directly affects the Yukon Territory and the Northwest Territories.<br>&ensp;(4) Nothing in this section shall be construed so as to derogate from subsection 35(1).<hr>"

    },
    {
    "title":"PART V",
    "text":"<p style=\"text-align:center\">PROCEDURE FOR AMENDING CONSTITUTION OF CANADA (101)</p><hr><small>General procedure for amending Constitution of Canada</small><br><br>&ensp;<b>38. </b>(1) An amendment to the Constitution of Canada may be made by proclamation issued by the Governor General under the Great Seal of Canada where so authorized by<br>&ensp;(a) resolutions of the Senate and House of Commons; and<br>&ensp;(b) resolutions of the legislative assemblies of at least two-thirds of the provinces that have, in the aggregate, according to the then latest general census, at least fifty per cent of the population of all the provinces.<hr><small>Majority of members</small><br><br>&ensp;(2) An amendment made under subsection (1) that derogates from the legislative powers, the proprietary rights or any other rights or privileges of the legislature or government of a province shall require a resolution supported by a majority of the members of each of the Senate, the House of Commons and the legislative assemblies required under subsection (1).<hr><small>Expression of dissent</small><br><br>&ensp;(3) An amendment referred to in subsection (2) shall not have effect in a province the legislative assembly of which has expressed its dissent thereto by resolution supported by a majority of its members prior to the issue of the proclamation to which the amendment relates unless that legislative assembly, subsequently, by resolution supported by a majority of its members, revokes its dissent and authorizes the amendment.<hr><small>Revocation of dissent</small><br><br>&ensp;(4) A resolution of dissent made for the purposes of subsection (3) may be revoked at any time before or after the issue of the proclamation to which it relates.<hr><small>Restriction on proclamation</small><br><br>&ensp;<b>39. </b>(1) A proclamation shall not be issued under subsection 38(1) before the expiration of one year from the adoption of the resolution initiating the amendment procedure thereunder, unless the legislative assembly of each province has previously adopted a resolution of assent or dissent.<hr><small>Idem</small><br><br>&ensp;(2) A proclamation shall not be issued under subsection 38(1) after the expiration of three years from the adoption of the resolution initiating the amendment procedure thereunder.<hr><small>Compensation</small><br><br>&ensp;<b>40. </b>Where an amendment is made under subsection 38(1) that transfers provincial legislative powers relating to education or other cultural matters from provincial legislatures to Parliament, Canada shall provide reasonable compensation to any province to which the amendment does not apply.<hr><small>Amendment by unanimous consent</small><br><br>&ensp;<b>41. </b>An amendment to the Constitution of Canada in relation to the following matters may be made by proclamation issued by the Governor General under the Great Seal of Canada only where authorized by resolutions of the Senate and House of Commons and of the legislative assembly of each province:<br>&ensp;(a) the office of the Queen, the Governor General and the Lieutenant Governor of a province;<br>&ensp;(b) the right of a province to a number of members in the House of Commons not less than the number of Senators by which the province is entitled to be represented at the time this Part comes into force;<br>&ensp;(c) subject to section 43, the use of the English or the French language;<br>&ensp;(d) the composition of the Supreme Court of Canada; and<br>&ensp;(e) an amendment to this Part.<hr><small>Amendment by general procedure</small><br><br>&ensp;<b>42. </b>(1) An amendment to the Constitution of Canada in relation to the following matters may be made only in accordance with subsection 38(1):<br>&ensp;(a) the principle of proportionate representation of the provinces in the House of Commons prescribed by the Constitution of Canada;<br>&ensp;(b) the powers of the Senate and the method of selecting Senators;<br>&ensp;(c) the number of members by which a province is entitled to be represented in the Senate and the residence qualifications of Senators;<br>&ensp;(d) subject to paragraph 41(d), the Supreme Court of Canada;<br>&ensp;(e) the extension of existing provinces into the territories; and<br>&ensp;(f) notwithstanding any other law or practice, the establishment of new provinces.<hr><small>Exception</small><br><br>&ensp;(2) Subsections 38(2) to (4) do not apply in respect of amendments in relation to matters referred to in subsection (1).<hr><small>Amendment of provisions relating to some but not all provinces</small><br><br>&ensp;<b>43. </b>An amendment to the Constitution of Canada in relation to any provision that applies to one or more, but not all, provinces, including<br>&ensp;((a) any alteration to boundaries between provinces, and<br>&ensp;((b) any amendment to any provision that relates to the use of the English or the French language within a province,<br>may be made by proclamation issued by the Governor General under the Great Seal of Canada only where so authorized by resolutions of the Senate and House of Commons and of the legislative assembly of each province to which the amendment applies.<hr><small>Amendments by Parliament</small><br><br>&ensp;<b>44. </b>Subject to sections 41 and 42, Parliament may exclusively make laws amending the Constitution of Canada in relation to the executive government of Canada or the Senate and House of Commons.<hr><small>Amendments by provincial legislatures</small><br><br>&ensp;<b>45. </b>Subject to section 41, the legislature of each province may exclusively make laws amending the constitution of the province.<hr><small>Initiation of amendment procedures</small><br><br>&ensp;<b>46. </b>(1) The procedures for amendment under sections 38, 41, 42 and 43 may be initiated either by the Senate or the House of Commons or by the legislative assembly of a province.<hr><small>Revocation of authorization</small><br><br>&ensp;(2) A resolution of assent made for the purposes of this Part may be revoked at any time before the issue of a proclamation authorized by it.<hr><small>Amendments without Senate resolution</small><br><br>&ensp;<b>47. </b>(1) An amendment to the Constitution of Canada made by proclamation under section 38, 41, 42 or 43 may be made without a resolution of the Senate authorizing the issue of the proclamation if, within one hundred and eighty days after the adoption by the House of Commons of a resolution authorizing its issue, the Senate has not adopted such a resolution and if, at any time after the expiration of that period, the House of Commons again adopts the resolution.<hr><small>Computation of period</small><br><br>&ensp;(2) Any period when Parliament is prorogued or dissolved shall not be counted in computing the one hundred and eighty day period referred to in subsection (1).<hr><small>Advice to issue proclamation</small><br><br>&ensp;<b>48. </b>The Queen’s Privy Council for Canada shall advise the Governor General to issue a proclamation under this Part forthwith on the adoption of the resolutions required for an amendment made by proclamation under this Part.<hr><small>Constitutional conference</small><br><br>&ensp;<b>49. </b>A constitutional conference composed of the Prime Minister of Canada and the first ministers of the provinces shall be convened by the Prime Minister of Canada within fifteen years after this Part comes into force to review the provisions of this Part. (102)<hr>",
    "notes":"<b><sup>(101)</sup> Prior to the enactment of Part V, certain provisions of the Constitution of Canada and the provincial constitutions could be amended pursuant to the Constitution Act, 1867. See footnotes (44) and (48) to section 91, Class 1 and section 92, Class 1 of that Act, respectively. Other amendments to the Constitution could only be made by enactment of the Parliament of the United Kingdom.</b><hr><b><sup>(102)</sup> A First Ministers Meeting was held June 20-21, 1996.</b><hr>"
    },
    {
    "title":"PART VI",
    "text":"<p style=\"text-align:center\">AMENDMENT TO THE CONSTITUTION ACT, 1867</p><hr>&ensp;<b>50. </b>(103)<hr>&ensp;<b>51. </b>(104)<hr>",
    "notes":"<b><sup>(103)</sup> The text of this amendment is set out in the <i>Constitution Act, 1867,</i> as section 92A.</b><hr><b><sup>(104)</sup> The text of this amendment is set out in the <i>Constitution Act, 1867,</i> as the Sixth Schedule.</b><hr>"
    },
    {
    "title":"PART VII",
    "text":"<p style=\"text-align:center\">GENERAL</p><hr><small>Primacy of Constitution of Canada</small><br><br>&ensp;<b>52. </b>(1) The Constitution of Canada is the supreme law of Canada, and any law that is inconsistent with the provisions of the Constitution is, to the extent of the inconsistency, of no force or effect.<hr><small>Constitution of Canada</small><br><br>&ensp;(2) The Constitution of Canada includes<br>&ensp;(a) the Canada Act 1982, including this Act;<br>&ensp;(b) the Acts and orders referred to in the schedule; and<br>&ensp;(c) any amendment to any Act or order referred to in paragraph (a) or (b).<hr><small>Amendments to Constitution of Canada</small><br><br>&ensp;(3) Amendments to the Constitution of Canada shall be made only in accordance with the authority contained in the Constitution of Canada.<hr><small>Repeals and new names</small><br><br>&ensp;<b>53. </b>(1) The enactments referred to in Column I of the schedule are hereby repealed or amended to the extent indicated in Column II thereof and, unless repealed, shall continue as law in Canada under the names set out in Column III thereof.<hr><small>Consequential amendments</small><br><br>&ensp;(2) Every enactment, except the Canada Act 1982, that refers to an enactment referred to in the schedule by the name in Column I thereof is hereby amended by substituting for that name the corresponding name in Column III thereof, and any British North America Act not referred to in the schedule may be cited as the Constitution Act followed by the year and number, if any, of its enactment.<hr><small>Repeal and consequential amendments</small><br><br>&ensp;<b>54. </b>Part IV is repealed on the day that is one year after this Part comes into force and this section may be repealed and this Act renumbered, consequentially upon the repeal of Part IV and this section, by proclamation issued by the Governor General under the Great Seal of Canada. (105)<hr>&ensp;<b>54.1 </b>Repealed. (106)<hr><small>French version of Constitution of Canada</small><br><br>&ensp;<b>55. </b>A French version of the portions of the Constitution of Canada referred to in the schedule shall be prepared by the Minister of Justice of Canada as expeditiously as possible and, when any portion thereof sufficient to warrant action being taken has been so prepared, it shall be put forward for enactment by proclamation issued by the Governor General under the Great Seal of Canada pursuant to the procedure then applicable to an amendment of the same provisions of the Constitution of Canada. (107)<hr><small>English and French versions of certain constitutional texts</small><br><br>&ensp;<b>56. </b>Where any portion of the Constitution of Canada has been or is enacted in English and French or where a French version of any portion of the Constitution is enacted pursuant to section 55, the English and French versions of that portion of the Constitution are equally authoritative.<hr><small>English and French versions of this Act</small><br><br>&ensp;<b>57. </b>The English and French versions of this Act are equally authoritative.<hr><small>Commencement</small><br><br>&ensp;<b>58. </b>Subject to section 59, this Act shall come into force on a day to be fixed by proclamation issued by the Queen or the Governor General under the Great Seal of Canada. (108)<hr><small>Commencement of paragraph 23(1)(a) in respect of Quebec</small><br><br>&ensp;<b>59. </b>(1) Paragraph 23(1)(a) shall come into force in respect of Quebec on a day to be fixed by proclamation issued by the Queen or the Governor General under the Great Seal of Canada.<hr><small>Authorization of Quebec</small><br><br>&ensp;(2) A proclamation under subsection (1) shall be issued only where authorized by the legislative assembly or government of Quebec. (109)<hr><small>Repeal of this section</small><br><br>&ensp;(3) This section may be repealed on the day paragraph 23(1)(a) comes into force in respect of Quebec and this Act amended and renumbered, consequentially upon the repeal of this section, by proclamation issued by the Queen or the Governor General under the Great Seal of Canada.<hr><small>Short title and citations</small><br><br>&ensp;<b>60. </b>This Act may be cited as the Constitution Act, 1982, and the Constitution Acts 1867 to 1975 (No. 2) and this Act may be cited together as the Constitution Acts, 1867 to 1982.<hr><small>References</small><br><br>&ensp;<b>61. </b>A reference to the “Constitution Acts, 1867 to 1982” shall be deemed to include a reference to the “Constitution Amendment Proclamation, 1983”. (110)<hr>",
    "notes":"<b><sup>(105)</sup> Part VII came into force on April 17, 1982 (see SI/82-97).</b><hr><b><sup>(106)</sup> Section 54.1, which was added by the Constitution Amendment Proclamation, 1983 (see SI/84-102), provided for the repeal of Part IV.1 and section 54.1 on April 18, 1987. Section 54.1 read as follows:</b><br>&ensp;<b>54.1 </b>Part IV.1 and this section are repealed on April 18, 1987.<hr><b><sup>(107)</sup> The French Constitutional Drafting Committee was established in 1984 with a mandate to assist the Minister of Justice in that task. The Committee's Final Report was tabled in Parliament in December 1990.</b><hr><b><sup>(108)</sup>  The Act, with the exception of paragraph 23(1)(a) in respect of Quebec, came into force on April 17, 1982 by proclamation issued by the Queen (see SI/82-97).</b><hr><b><sup>(109)</sup> No proclamation has been issued under section 59.</b><hr><b><sup>(110)</sup> Section 61 was added by the Constitution Amendment Proclamation, 1983 (see SI/84-102). See also section 3 of the Constitution Act, 1985 (Representation), S.C. 1986, c. 8, Part I and the Constitution Amendment, 1987 (Newfoundland Act) (see SI/88-11).</b><hr>"
    }
]
