[
    {
              "title": "I. PRELIMINARY",
              "text": "<small>Short title</small><br><br>&ensp;<b>1. </b>This Act may be cited as the <i>Constitution Act, 1867.</i> (2)<br>&ensp;<b>2. </b> Repealed. (3)",
              "notes": "<b><sup>(2)</sup> As amended by the Constitution Act, 1982, which came into force on April 17, 1982. The section originally read as follows:</b><br>&ensp; 1. This Act may be cited as <i>The British North America Act, 1867.</i><br><br><b><sup>(3)</sup> Section 2, repealed by the Statute Law Revision Act, 1893, 56-57 Vict., c. 14 (U.K.), read as follows:</b><br>&ensp; 2.The Provisions of this Act referring to Her Majesty the Queen extend also to the Heirs and Successors of Her Majesty, Kings and Queens of the United Kingdom of Great Britain and Ireland."
            },
            {
                "title": "II. UNION",
                "text" : "<small>Declaration of Union</small><br><br>&ensp;<b>3.</b> It shall be lawful for the Queen, by and with the Advice of Her Majesty’s Most Honourable Privy Council, to declare by Proclamation that, on and after a Day therein appointed, not being more than Six Months after the passing of this Act, the Provinces of Canada, Nova Scotia, and New Brunswick shall form and be One Dominion under the Name of Canada; and on and after that Day those Three Provinces shall form and be One Dominion under that Name accordingly. (4)<br><br><small>Construction of subsequent Provisions of Act</small><br><br>&ensp;<b>4.</b> Unless it is otherwise expressed or implied, the Name Canada shall be taken to mean Canada as constituted under this Act. (5)<br><br><small>Four Provinces</small><br><br>&ensp;<b>5.</b> Canada shall be divided into Four Provinces, named Ontario, Quebec, Nova Scotia, and New Brunswick. (6)<br><br><small>Provinces of Ontario and Quebec</small><br><br>&ensp;<b>6.</b> The Parts of the Province of Canada (as it exists at the passing of this Act) which formerly constituted respectively the Provinces of Upper Canada and Lower Canada shall be deemed to be severed, and shall form Two separate Provinces. The Part which formerly constituted the Province of Upper Canada shall constitute the Province of Ontario; and the Part which formerly constituted the Province of Lower Canada shall constitute the Province of Quebec.<br><br><small>Provinces of Nova Scotia and New Brunswick</small><br><br>&ensp;<b>7.</b> The Provinces of Nova Scotia and New Brunswick shall have the same Limits as at the passing of this Act.<br><br><small>Decennial Census</small><br><br>&ensp;<b>8.</b> In the general Census of the Population of Canada which is hereby required to be taken in the Year One thousand eight hundred and seventy-one, and in every Tenth Year thereafter, the respective Populations of the Four Provinces shall be distinguished.<br><br>",
                "notes":"<b><sup>(4)</sup>The first day of July, 1867, was fixed by proclamation dated May 22, 1867.</b><hr><b><sup>(5)</sup> Partially repealed by the <i>Statute Law Revision Act, 1893</i>, 56-57 Vict., c. 14 (U.K.). The section originally read as follows:</b><br>&ensp;<b>4.</b>  The subsequent Provisions of this Act shall, unless it is otherwise expressed or implied, commence and have effect on and after the Union, that is to say, on and after the Day appointed for the Union taking effect in the Queen’s Proclamation; and in the same Provisions, unless it is otherwise expressed or implied, the Name Canada shall be taken to mean Canada as constituted under this Act.<hr><b><sup>(6)</sup> Canada now consists of ten provinces (Ontario, Quebec, Nova Scotia, New Brunswick, Manitoba, British Columbia, Prince Edward Island, Alberta, Saskatchewan and Newfoundland and Labrador) and three territories (Yukon, the Northwest Territories and Nunavut).<br><br>The first territories added to the Union were Rupert’s Land and the North-Western Territory (subsequently designated the Northwest Territories), which were admitted pursuant to section 146 of the Constitution Act, 1867 and the Rupert’s Land Act, 1868, 31-32 Vict., c. 105 (U.K.), by the Rupert’s Land and North-Western Territory Order of June 23, 1870, effective July 15, 1870. Prior to the admission of those territories, the Parliament of Canada enacted An Act for the temporary Government of Rupert’s Land and the North-Western Territory when united with Canada (32-33 Vict., c. 3), and the Manitoba Act, 1870 (33 Vict., c. 3), which provided for the formation of the Province of Manitoba.<br><br>British Columbia was admitted into the Union pursuant to section 146 of the Constitution Act, 1867, by the British Columbia Terms of Union, being Order in Council of May 16, 1871, effective July 20, 1871.<br><br>Prince Edward Island was admitted pursuant to section 146 of the Constitution Act, 1867, by the Prince Edward Island Terms of Union, being Order in Council of June 26, 1873, effective July 1, 1873.<br><br>On June 29, 1871, the United Kingdom Parliament enacted the Constitution Act, 1871 (34-35 Vict., c. 28) authorizing the creation of additional provinces out of territories not included in any province. Pursuant to this statute, the Parliament of Canada enacted the Alberta Act (July 20, 1905, 4-5 Edw. VII, c. 3) and the Saskatchewan Act (July 20, 1905, 4-5 Edw. VII, c. 42), providing for the creation of the provinces of Alberta and Saskatchewan, respectively. Both of these Acts came into force on September 1, 1905.<br><br>Meanwhile, all remaining British possessions and territories in North America and the islands adjacent thereto, except the colony of Newfoundland and its dependencies, were admitted into the Canadian Confederation by the Adjacent Territories Order, dated July 31, 1880.<br><br>The Parliament of Canada added portions of the Northwest Territories to the adjoining provinces in 1912 by The Ontario Boundaries Extension Act, S.C. 1912, 2 Geo. V, c. 40, The Quebec Boundaries Extension Act, 1912, 2 Geo. V, c. 45 and The Manitoba Boundaries Extension Act, 1912, 2 Geo. V, c. 32, and further additions were made to Manitoba by The Manitoba Boundaries Extension Act, 1930, 20-21 Geo. V, c. 28.<br><br>The Yukon Territory was created out of the Northwest Territories in 1898 by The Yukon Territory Act, 61 Vict., c. 6.<br><br>Newfoundland was added on March 31, 1949, by the Newfoundland Act, 12-13 Geo. VI, c. 22 (U.K.), which ratified the Terms of Union of Newfoundland with Canada.<br>Nunavut was created out of the Northwest Territories in 1999 by the Nunavut Act, S.C. 1993, c. 28.</b><br><br>"
            },
            {
                "title": "III. EXECUTIVE POWER",
                "text": "<small>Declaration of Executive Power in the Queen</small><br><br>&ensp;<b>9.</b> The Executive Government and Authority of and over Canada is hereby declared to continue and be vested in the Queen.<br><br><small>Application of Provisions referring to Governor General</small><br><br>&ensp;<b>10.</b> The Provisions of this Act referring to the Governor General extend and apply to the Governor General for the Time being of Canada, or other the Chief Executive Officer or Administrator for the Time being carrying on the Government of Canada on behalf and in the Name of the Queen, by whatever Title he is designated.<br><br><small>Constitution of Privy Council for Canada</small><br><br>&ensp;<b>11.</b> There shall be a Council to aid and advise in the Government of Canada, to be styled the Queen’s Privy Council for Canada; and the Persons who are to be Members of that Council shall be from Time to Time chosen and summoned by the Governor General and sworn in as Privy Councillors, and Members thereof may be from Time to Time removed by the Governor General.<br><br><small>All Powers under Acts to be exercised by Governor General with Advice of Privy Council, or alone</small><br><br>&ensp;<b>12.</b> All Powers, Authorities, and Functions which under any Act of the Parliament of Great Britain, or of the Parliament of the United Kingdom of Great Britain and Ireland, or of the Legislature of Upper Canada, Lower Canada, Canada, Nova Scotia, or New Brunswick, are at the Union vested in or exerciseable by the respective Governors or Lieutenant Governors of those Provinces, with the Advice, or with the Advice and Consent, of the respective Executive Councils thereof, or in conjunction with those Councils, or with any Number of Members thereof, or by those Governors or Lieutenant Governors individually, shall, as far as the same continue in existence and capable of being exercised after the Union in relation to the Government of Canada, be vested in and exerciseable by the Governor General, with the Advice or with the Advice and Consent of or in conjunction with the Queen’s Privy Council for Canada, or any Members thereof, or by the Governor General individually, as the Case requires, subject nevertheless (except with respect to such as exist under Acts of the Parliament of Great Britain or of the Parliament of the United Kingdom of Great Britain and Ireland) to be abolished or altered by the Parliament of Canada. (7)<br><br><small>Application of Provisions referring to Governor General in Council</small><br><br>&ensp;<b>13.</b> The Provisions of this Act referring to the Governor General in Council shall be construed as referring to the Governor General acting by and with the Advice of the Queen’s Privy Council for Canada.<br><br><small>Power to Her Majesty to authorize Governor General to appoint Deputies</small><br><br>&ensp;<b>14.</b> It shall be lawful for the Queen, if Her Majesty thinks fit, to authorize the Governor General from Time to Time to appoint any Person or any Persons jointly or severally to be his Deputy or Deputies within any Part or Parts of Canada, and in that Capacity to exercise during the Pleasure of the Governor General such of the Powers, Authorities, and Functions of the Governor General as the Governor General deems it necessary or expedient to assign to him or them, subject to any Limitations or Directions expressed or given by the Queen; but the Appointment of such a Deputy or Deputies shall not affect the Exercise by the Governor General himself of any Power, Authority, or Function.<br><br><small>Command of Armed Forces to continue to be vested in the Queen</small><br><br>&ensp;<b>15.</b> The Command-in-Chief of the Land and Naval Militia, and of all Naval and Military Forces, of and in Canada, is hereby declared to continue and be vested in the Queen.<br><br><small>Seat of Government of Canada</small><br><br>&ensp;<b>16.</b> Until the Queen otherwise directs, the Seat of Government of Canada shall be Ottawa.<br><br>",
                "notes":"<b><sup>(7)</sup> See footnote (65) to section 129.</b>"
            },
            {
                "title":"IV. LEGISLATIVE POWER",
                "text": "<small>Constitution of Parliament of Canada</small><br><br>&ensp;<b>17.</b> There shall be One Parliament for Canada, consisting of the Queen, an Upper House styled the Senate, and the House of Commons.<hr><small>Privileges, etc., of Houses</small><br><br>&ensp;<b>18. </b>The privileges, immunities, and powers to be held, enjoyed, and exercised by the Senate and by the House of Commons, and by the members thereof respectively, shall be such as are from time to time defined by Act of the Parliament of Canada, but so that any Act of the Parliament of Canada defining such privileges, immunities, and powers shall not confer any privileges, immunities, or powers exceeding those at the passing of such Act held, enjoyed, and exercised by the Commons House of Parliament of the United Kingdom of Great Britain and Ireland, and by the members thereof. (8)<hr><small>First Session of the Parliament of Canada</small><br><br>&ensp;<b>19. </b>The Parliament of Canada shall be called together not later than Six Months after the Union. (9)<br>&ensp;<b>20. </b>Repealed. (10)<hr><p style=\"text-align:center\">The Senate</p><small>Number of Senators</small><br><br>&ensp;<b>21. </b>The Senate shall, subject to the Provisions of this Act, consist of One Hundred and five Members, who shall be styled Senators. (11)<hr><small>Representation of Provinces in Senate</small><br><br>&ensp;<b>22. </b>In relation to the Constitution of the Senate Canada shall be deemed to consist of Four Divisions:<ol><li>Ontario;</li><li>Quebec;</li><li>The Maritime Provinces, Nova Scotia and New Brunswick, and Prince Edward Island;</li><li>The Western Provinces of Manitoba, British Columbia, Saskatchewan, and Alberta;<br>which Four Divisions shall (subject to the Provisions of this Act) be equally represented in the Senate as follows: Ontario by twenty-four senators; Quebec by twenty-four senators; the Maritime Provinces and Prince Edward Island by twenty-four senators, ten thereof representing Nova Scotia, ten thereof representing New Brunswick, and four thereof representing Prince Edward Island; the Western Provinces by twenty-four senators, six thereof representing Manitoba, six thereof representing British Columbia, six thereof representing Saskatchewan, and six thereof representing Alberta; Newfoundland shall be entitled to be represented in the Senate by six members; the Yukon Territory, the Northwest Territories and Nunavut shall be entitled to be represented in the Senate by one member each.</li></ol><br>In the Case of Quebec each of the Twenty-four Senators representing that Province shall be appointed for One of the Twenty-four Electoral Divisions of Lower Canada specified in Schedule A. to Chapter One of the Consolidated Statutes of Canada. (12)<hr><small>Qualifications of Senator</small><br><br>&ensp;<b>23. </b>The Qualifications of a Senator shall be as follows:<br><br><ol><li>He shall be of the full age of Thirty Years;</li><li>He shall be either a natural-born Subject of the Queen, or a Subject of the Queen naturalized by an Act of the Parliament of Great Britain, or of the Parliament of the United Kingdom of Great Britain and Ireland, or of the Legislature of One of the Provinces of Upper Canada, Lower Canada, Canada, Nova Scotia, or New Brunswick, before the Union, or of the Parliament of Canada after the Union;</li><li>He shall be legally or equitably seised as of Freehold for his own Use and Benefit of Lands or Tenements held in Free and Common Socage, or seised or possessed for his own Use and Benefit of Lands or Tenements held in Franc-alleu or in Roture, within the Province for which he is appointed, of the Value of Four thousand Dollars, over and above all Rents, Dues, Debts, Charges, Mortgages, and Incumbrances due or payable out of or charged on or affecting the same;</li><li>His Real and Personal Property shall be together worth Four thousand Dollars over and above his Debts and Liabilities;</li><li>He shall be resident in the Province for which he is appointed;</li><li>In the Case of Quebec he shall have his Real Property Qualification in the Electoral Division for which he is appointed, or shall be resident in that Division. (13)</li></ol><hr><small>Summons of Senator</small><br><br>&ensp;<b>24. </b>The Governor General shall from Time to Time, in the Queen’s Name, by Instrument under the Great Seal of Canada, summon qualified Persons to the Senate; and, subject to the Provisions of this Act, every Person so summoned shall become and be a Member of the Senate and a Senator.<hr>&ensp;<b>25. </b>Repealed. (14)<hr><small>Addition of Senators in certain cases</small><br><br>&ensp;<b>26. </b>If at any Time on the Recommendation of the Governor General the Queen thinks fit to direct that Four or Eight Members be added to the Senate, the Governor General may by Summons to Four or Eight qualified Persons (as the Case may be), representing equally the Four Divisions of Canada, add to the Senate accordingly. (15)<hr><small>Reduction of Senate to normal Number</small><br><br>&ensp;<b>27. </b>In case of such Addition being at any Time made, the Governor General shall not summon any Person to the Senate, except on a further like Direction by the Queen on the like Recommendation, to represent one of the Four Divisions until such Division is represented by Twenty-four Senators and no more. (16)<hr><small>Maximum Number of Senators</small><br><br>&ensp;<b>28. </b>The Number of Senators shall not at any Time exceed One Hundred and thirteen. (17)<hr><small>Tenure of Place in Senate</small><br><br>&ensp;<b>29. </b>(1) Subject to subsection (2), a Senator shall, subject to the provisions of this Act, hold his place in the Senate for life.<hr><small>Retirement upon attaining age of seventy-five years</small><br><br>(2) A Senator who is summoned to the Senate after the coming into force of this subsection shall, subject to this Act, hold his place in the Senate until he attains the age of seventy-five years. (18)<hr><small>Resignation of Place in Senate</small><br><br>&ensp;<b>30. </b>A Senator may by Writing under his Hand addressed to the Governor General resign his Place in the Senate, and thereupon the same shall be vacant.<hr><small>Disqualification of Senators</small><br><br>&ensp;<b>31. </b>The Place of a Senator shall become vacant in any of the following Cases:<ol><li>If for Two consecutive Sessions of the Parliament he fails to give his Attendance in the Senate;</li><li>If he takes an Oath or makes a Declaration or Acknowledgment of Allegiance, Obedience, or Adherence to a Foreign Power, or does an Act whereby he becomes a Subject or Citizen, or entitled to the Rights or Privileges of a Subject or Citizen, of a Foreign Power;</li><li>If he is adjudged Bankrupt or Insolvent, or applies for the Benefit of any Law relating to Insolvent Debtors, or becomes a public Defaulter;</li><li>If he is attainted of Treason or convicted of Felony or of any infamous Crime;</li><li>If he ceases to be qualified in respect of Property or of Residence; provided, that a Senator shall not be deemed to have ceased to be qualified in respect of Residence by reason only of his residing at the Seat of the Government of Canada while holding an Office under that Government requiring his Presence there.</li></ol><hr><small>Summons on Vacancy in Senate</small><br><br>&ensp;<b>32. </b>When a Vacancy happens in the Senate by Resignation, Death, or otherwise, the Governor General shall by Summons to a fit and qualified Person fill the Vacancy.<hr><small>Questions as to Qualifications and Vacancies in Senate</small><br><br>&ensp;<b>33. </b>If any Question arises respecting the Qualification of a Senator or a Vacancy in the Senate the same shall be heard and determined by the Senate.<hr><small>Appointment of Speaker of Senate</small><br><br>&ensp;<b>34. </b>The Governor General may from Time to Time, by Instrument under the Great Seal of Canada, appoint a Senator to be Speaker of the Senate, and may remove him and appoint another in his Stead. (19)<hr><small>Quorum of Senate</small><br><br>&ensp;<b>35. </b>Until the Parliament of Canada otherwise provides, the Presence of at least Fifteen Senators, including the Speaker, shall be necessary to constitute a Meeting of the Senate for the Exercise of its Powers.<hr>                <small>Voting in Senate</small><br><br>&ensp;<b>36. </b>Questions arising in the Senate shall be decided by a Majority of Voices, and the Speaker shall in all Cases have a Vote, and when the Voices are equal the Decision shall be deemed to be in the Negative.<hr>",
                "notes":""
            }
]

